/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const PMIX_ALLOC_NETWORK_PLANE: &[u8; 20] = b"pmix.alloc.netplane\0";
pub const PMIX_ALLOC_NETWORK_ENDPTS: &[u8; 18] = b"pmix.alloc.endpts\0";
pub const PMIX_ALLOC_NETWORK_ENDPTS_NODE: &[u8; 21] = b"pmix.alloc.endpts.nd\0";
pub const PMIX_ALLOC_NETWORK_SEC_KEY: &[u8; 16] = b"pmix.alloc.nsec\0";
pub const PMIX_PROC_DATA: &[u8; 11] = b"pmix.pdata\0";
pub const PMIX_LOCALITY: &[u8; 9] = b"pmix.loc\0";
pub const PMIX_LOCAL_TOPO: &[u8; 11] = b"pmix.ltopo\0";
pub const PMIX_TOPOLOGY_XML: &[u8; 14] = b"pmix.topo.xml\0";
pub const PMIX_TOPOLOGY_FILE: &[u8; 15] = b"pmix.topo.file\0";
pub const PMIX_TOPOLOGY_SIGNATURE: &[u8; 13] = b"pmix.toposig\0";
pub const PMIX_HWLOC_SHMEM_ADDR: &[u8; 15] = b"pmix.hwlocaddr\0";
pub const PMIX_HWLOC_SHMEM_SIZE: &[u8; 15] = b"pmix.hwlocsize\0";
pub const PMIX_HWLOC_SHMEM_FILE: &[u8; 15] = b"pmix.hwlocfile\0";
pub const PMIX_HWLOC_XML_V1: &[u8; 15] = b"pmix.hwlocxml1\0";
pub const PMIX_HWLOC_XML_V2: &[u8; 15] = b"pmix.hwlocxml2\0";
pub const PMIX_HWLOC_SHARE_TOPO: &[u8; 13] = b"pmix.hwlocsh\0";
pub const PMIX_HWLOC_HOLE_KIND: &[u8; 16] = b"pmix.hwlocholek\0";
pub const PMIX_DSTPATH: &[u8; 13] = b"pmix.dstpath\0";
pub const PMIX_COLLECTIVE_ALGO: &[u8; 11] = b"pmix.calgo\0";
pub const PMIX_COLLECTIVE_ALGO_REQD: &[u8; 13] = b"pmix.calreqd\0";
pub const PMIX_PROC_BLOB: &[u8; 11] = b"pmix.pblob\0";
pub const PMIX_MAP_BLOB: &[u8; 11] = b"pmix.mblob\0";
pub const PMIX_MAPPER: &[u8; 12] = b"pmix.mapper\0";
pub const PMIX_NON_PMI: &[u8; 12] = b"pmix.nonpmi\0";
pub const PMIX_PROC_URI: &[u8; 10] = b"pmix.puri\0";
pub const PMIX_ARCH: &[u8; 10] = b"pmix.arch\0";
pub const PMIX_DEBUG_JOB_DIRECTIVES: &[u8; 15] = b"pmix.dbg.jdirs\0";
pub const PMIX_DEBUG_APP_DIRECTIVES: &[u8; 15] = b"pmix.dbg.adirs\0";
pub const PMIX_EVENT_NO_TERMINATION: &[u8; 14] = b"pmix.evnoterm\0";
pub const PMIX_EVENT_WANT_TERMINATION: &[u8; 12] = b"pmix.evterm\0";
pub const PMIX_TAG_OUTPUT: &[u8; 12] = b"pmix.tagout\0";
pub const PMIX_TIMESTAMP_OUTPUT: &[u8; 11] = b"pmix.tsout\0";
pub const PMIX_MERGE_STDERR_STDOUT: &[u8; 17] = b"pmix.mergeerrout\0";
pub const PMIX_OUTPUT_TO_FILE: &[u8; 13] = b"pmix.outfile\0";
pub const PMIX_OUTPUT_TO_DIRECTORY: &[u8; 12] = b"pmix.outdir\0";
pub const PMIX_OUTPUT_NOCOPY: &[u8; 12] = b"pmix.nocopy\0";
pub const PMIX_GDS_MODULE: &[u8; 13] = b"pmix.gds.mod\0";
pub const PMIX_BFROPS_MODULE: &[u8; 16] = b"pmix.bfrops.mod\0";
pub const PMIX_PNET_SETUP_APP: &[u8; 17] = b"pmix.pnet.setapp\0";
pub const PMIX_IOF_STOP: &[u8; 14] = b"pmix.iof.stop\0";
pub const PMIX_NOTIFY_LAUNCH: &[u8; 15] = b"pmix.note.lnch\0";
pub type wchar_t = ::std::os::raw::c_int;
pub type __cfloat128 = __BindgenComplex<u128>;
pub type _Float128 = u128;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
    pub __unused_initialized_1: ::std::os::raw::c_uint,
    pub __unused_initialized_2: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 16usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 28usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 32usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_1"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_1) - 40usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_2"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_2) - 44usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn arc4random() -> __uint32_t;
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __size: usize);
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
    -> ::std::os::raw::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub _short_backupbuf: [::std::os::raw::c_char; 1usize],
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub _prevchain: *mut *mut _IO_FILE,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_short_backupbuf"]
        [::std::mem::offset_of!(_IO_FILE, _short_backupbuf) - 119usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::_prevchain"]
        [::std::mem::offset_of!(_IO_FILE, _prevchain) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
impl _IO_FILE {
    #[inline]
    pub fn _flags2(&self) -> ::std::os::raw::c_int {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set__flags2(&mut self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _flags2_raw(this: *const Self) -> ::std::os::raw::c_int {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                24u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__flags2_raw(this: *mut Self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(_flags2: ::std::os::raw::c_int) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 24u8, {
            let _flags2: u32 = unsafe { ::std::mem::transmute(_flags2) };
            _flags2 as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_cookie_io_functions_t"]
        [::std::mem::size_of::<_IO_cookie_io_functions_t>() - 32usize];
    ["Alignment of _IO_cookie_io_functions_t"]
        [::std::mem::align_of::<_IO_cookie_io_functions_t>() - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::read"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, read) - 0usize];
    ["Offset of field: _IO_cookie_io_functions_t::write"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, write) - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::seek"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, seek) - 16usize];
    ["Offset of field: _IO_cookie_io_functions_t::close"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, close) - 24usize];
};
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type va_list = __gnuc_va_list;
pub type fpos_t = __fpos_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
    -> *mut FILE;
}
unsafe extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
unsafe extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchrnul(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcasestr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn memmem(
        __haystack: *const ::std::os::raw::c_void,
        __haystacklen: usize,
        __needle: *const ::std::os::raw::c_void,
        __needlelen: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    );
}
unsafe extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
unsafe extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strlcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::std::mem::size_of::<itimerspec>() - 32usize];
    ["Alignment of itimerspec"][::std::mem::align_of::<itimerspec>() - 8usize];
    ["Offset of field: itimerspec::it_interval"]
        [::std::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::std::mem::offset_of!(itimerspec, it_value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
unsafe extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub const _ISupper: _bindgen_ty_1 = _bindgen_ty_1::_ISupper;
pub const _ISlower: _bindgen_ty_1 = _bindgen_ty_1::_ISlower;
pub const _ISalpha: _bindgen_ty_1 = _bindgen_ty_1::_ISalpha;
pub const _ISdigit: _bindgen_ty_1 = _bindgen_ty_1::_ISdigit;
pub const _ISxdigit: _bindgen_ty_1 = _bindgen_ty_1::_ISxdigit;
pub const _ISspace: _bindgen_ty_1 = _bindgen_ty_1::_ISspace;
pub const _ISprint: _bindgen_ty_1 = _bindgen_ty_1::_ISprint;
pub const _ISgraph: _bindgen_ty_1 = _bindgen_ty_1::_ISgraph;
pub const _ISblank: _bindgen_ty_1 = _bindgen_ty_1::_ISblank;
pub const _IScntrl: _bindgen_ty_1 = _bindgen_ty_1::_IScntrl;
pub const _ISpunct: _bindgen_ty_1 = _bindgen_ty_1::_ISpunct;
pub const _ISalnum: _bindgen_ty_1 = _bindgen_ty_1::_ISalnum;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_1 {
    _ISupper = 256,
    _ISlower = 512,
    _ISalpha = 1024,
    _ISdigit = 2048,
    _ISxdigit = 4096,
    _ISspace = 8192,
    _ISprint = 16384,
    _ISgraph = 32768,
    _ISblank = 1,
    _IScntrl = 2,
    _ISpunct = 4,
    _ISalnum = 8,
}
unsafe extern "C" {
    pub fn __ctype_b_loc() -> *mut *const ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn __ctype_tolower_loc() -> *mut *const __int32_t;
}
unsafe extern "C" {
    pub fn __ctype_toupper_loc() -> *mut *const __int32_t;
}
unsafe extern "C" {
    pub fn isalnum(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalpha(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iscntrl(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn islower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isgraph(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isprint(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ispunct(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isspace(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isxdigit(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tolower(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toupper(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isblank(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toascii(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _toupper(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _tolower(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalnum_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalpha_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iscntrl_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn islower_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isgraph_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isprint_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ispunct_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isspace_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isupper_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isxdigit_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isblank_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __tolower_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tolower_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __toupper_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toupper_l(__c: ::std::os::raw::c_int, __l: locale_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timezone"][::std::mem::size_of::<timezone>() - 8usize];
    ["Alignment of timezone"][::std::mem::align_of::<timezone>() - 4usize];
    ["Offset of field: timezone::tz_minuteswest"]
        [::std::mem::offset_of!(timezone, tz_minuteswest) - 0usize];
    ["Offset of field: timezone::tz_dsttime"]
        [::std::mem::offset_of!(timezone, tz_dsttime) - 4usize];
};
unsafe extern "C" {
    pub fn gettimeofday(
        __tv: *mut timeval,
        __tz: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> ::std::os::raw::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum __itimer_which {
    ITIMER_REAL = 0,
    ITIMER_VIRTUAL = 1,
    ITIMER_PROF = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerval"][::std::mem::size_of::<itimerval>() - 32usize];
    ["Alignment of itimerval"][::std::mem::align_of::<itimerval>() - 8usize];
    ["Offset of field: itimerval::it_interval"]
        [::std::mem::offset_of!(itimerval, it_interval) - 0usize];
    ["Offset of field: itimerval::it_value"][::std::mem::offset_of!(itimerval, it_value) - 16usize];
};
pub type __itimer_which_t = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn utimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lutimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn futimes(__fd: ::std::os::raw::c_int, __tvp: *const timeval) -> ::std::os::raw::c_int;
}
pub type useconds_t = __useconds_t;
pub type socklen_t = __socklen_t;
unsafe extern "C" {
    pub fn access(
        __name: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn faccessat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lseek(
        __fd: ::std::os::raw::c_int,
        __offset: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> __off_t;
}
unsafe extern "C" {
    pub fn close(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn closefrom(__lowfd: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn read(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn write(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pread(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: usize,
        __offset: __off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pwrite(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __offset: __off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pipe(__pipedes: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn alarm(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn sleep(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn ualarm(__value: __useconds_t, __interval: __useconds_t) -> __useconds_t;
}
unsafe extern "C" {
    pub fn usleep(__useconds: __useconds_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pause() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn chown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fchown(
        __fd: ::std::os::raw::c_int,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lchown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fchownat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn chdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fchdir(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getcwd(__buf: *mut ::std::os::raw::c_char, __size: usize)
    -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getwd(__buf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn dup(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dup2(__fd: ::std::os::raw::c_int, __fd2: ::std::os::raw::c_int)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut __environ: *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn execve(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fexecve(
        __fd: ::std::os::raw::c_int,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execv(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execle(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execl(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execvp(
        __file: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn execlp(
        __file: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nice(__inc: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _exit(__status: ::std::os::raw::c_int) -> !;
}
pub const _PC_LINK_MAX: _bindgen_ty_2 = _bindgen_ty_2::_PC_LINK_MAX;
pub const _PC_MAX_CANON: _bindgen_ty_2 = _bindgen_ty_2::_PC_MAX_CANON;
pub const _PC_MAX_INPUT: _bindgen_ty_2 = _bindgen_ty_2::_PC_MAX_INPUT;
pub const _PC_NAME_MAX: _bindgen_ty_2 = _bindgen_ty_2::_PC_NAME_MAX;
pub const _PC_PATH_MAX: _bindgen_ty_2 = _bindgen_ty_2::_PC_PATH_MAX;
pub const _PC_PIPE_BUF: _bindgen_ty_2 = _bindgen_ty_2::_PC_PIPE_BUF;
pub const _PC_CHOWN_RESTRICTED: _bindgen_ty_2 = _bindgen_ty_2::_PC_CHOWN_RESTRICTED;
pub const _PC_NO_TRUNC: _bindgen_ty_2 = _bindgen_ty_2::_PC_NO_TRUNC;
pub const _PC_VDISABLE: _bindgen_ty_2 = _bindgen_ty_2::_PC_VDISABLE;
pub const _PC_SYNC_IO: _bindgen_ty_2 = _bindgen_ty_2::_PC_SYNC_IO;
pub const _PC_ASYNC_IO: _bindgen_ty_2 = _bindgen_ty_2::_PC_ASYNC_IO;
pub const _PC_PRIO_IO: _bindgen_ty_2 = _bindgen_ty_2::_PC_PRIO_IO;
pub const _PC_SOCK_MAXBUF: _bindgen_ty_2 = _bindgen_ty_2::_PC_SOCK_MAXBUF;
pub const _PC_FILESIZEBITS: _bindgen_ty_2 = _bindgen_ty_2::_PC_FILESIZEBITS;
pub const _PC_REC_INCR_XFER_SIZE: _bindgen_ty_2 = _bindgen_ty_2::_PC_REC_INCR_XFER_SIZE;
pub const _PC_REC_MAX_XFER_SIZE: _bindgen_ty_2 = _bindgen_ty_2::_PC_REC_MAX_XFER_SIZE;
pub const _PC_REC_MIN_XFER_SIZE: _bindgen_ty_2 = _bindgen_ty_2::_PC_REC_MIN_XFER_SIZE;
pub const _PC_REC_XFER_ALIGN: _bindgen_ty_2 = _bindgen_ty_2::_PC_REC_XFER_ALIGN;
pub const _PC_ALLOC_SIZE_MIN: _bindgen_ty_2 = _bindgen_ty_2::_PC_ALLOC_SIZE_MIN;
pub const _PC_SYMLINK_MAX: _bindgen_ty_2 = _bindgen_ty_2::_PC_SYMLINK_MAX;
pub const _PC_2_SYMLINKS: _bindgen_ty_2 = _bindgen_ty_2::_PC_2_SYMLINKS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_2 {
    _PC_LINK_MAX = 0,
    _PC_MAX_CANON = 1,
    _PC_MAX_INPUT = 2,
    _PC_NAME_MAX = 3,
    _PC_PATH_MAX = 4,
    _PC_PIPE_BUF = 5,
    _PC_CHOWN_RESTRICTED = 6,
    _PC_NO_TRUNC = 7,
    _PC_VDISABLE = 8,
    _PC_SYNC_IO = 9,
    _PC_ASYNC_IO = 10,
    _PC_PRIO_IO = 11,
    _PC_SOCK_MAXBUF = 12,
    _PC_FILESIZEBITS = 13,
    _PC_REC_INCR_XFER_SIZE = 14,
    _PC_REC_MAX_XFER_SIZE = 15,
    _PC_REC_MIN_XFER_SIZE = 16,
    _PC_REC_XFER_ALIGN = 17,
    _PC_ALLOC_SIZE_MIN = 18,
    _PC_SYMLINK_MAX = 19,
    _PC_2_SYMLINKS = 20,
}
pub const _SC_ARG_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_ARG_MAX;
pub const _SC_CHILD_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_CHILD_MAX;
pub const _SC_CLK_TCK: _bindgen_ty_3 = _bindgen_ty_3::_SC_CLK_TCK;
pub const _SC_NGROUPS_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_NGROUPS_MAX;
pub const _SC_OPEN_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_OPEN_MAX;
pub const _SC_STREAM_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_STREAM_MAX;
pub const _SC_TZNAME_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_TZNAME_MAX;
pub const _SC_JOB_CONTROL: _bindgen_ty_3 = _bindgen_ty_3::_SC_JOB_CONTROL;
pub const _SC_SAVED_IDS: _bindgen_ty_3 = _bindgen_ty_3::_SC_SAVED_IDS;
pub const _SC_REALTIME_SIGNALS: _bindgen_ty_3 = _bindgen_ty_3::_SC_REALTIME_SIGNALS;
pub const _SC_PRIORITY_SCHEDULING: _bindgen_ty_3 = _bindgen_ty_3::_SC_PRIORITY_SCHEDULING;
pub const _SC_TIMERS: _bindgen_ty_3 = _bindgen_ty_3::_SC_TIMERS;
pub const _SC_ASYNCHRONOUS_IO: _bindgen_ty_3 = _bindgen_ty_3::_SC_ASYNCHRONOUS_IO;
pub const _SC_PRIORITIZED_IO: _bindgen_ty_3 = _bindgen_ty_3::_SC_PRIORITIZED_IO;
pub const _SC_SYNCHRONIZED_IO: _bindgen_ty_3 = _bindgen_ty_3::_SC_SYNCHRONIZED_IO;
pub const _SC_FSYNC: _bindgen_ty_3 = _bindgen_ty_3::_SC_FSYNC;
pub const _SC_MAPPED_FILES: _bindgen_ty_3 = _bindgen_ty_3::_SC_MAPPED_FILES;
pub const _SC_MEMLOCK: _bindgen_ty_3 = _bindgen_ty_3::_SC_MEMLOCK;
pub const _SC_MEMLOCK_RANGE: _bindgen_ty_3 = _bindgen_ty_3::_SC_MEMLOCK_RANGE;
pub const _SC_MEMORY_PROTECTION: _bindgen_ty_3 = _bindgen_ty_3::_SC_MEMORY_PROTECTION;
pub const _SC_MESSAGE_PASSING: _bindgen_ty_3 = _bindgen_ty_3::_SC_MESSAGE_PASSING;
pub const _SC_SEMAPHORES: _bindgen_ty_3 = _bindgen_ty_3::_SC_SEMAPHORES;
pub const _SC_SHARED_MEMORY_OBJECTS: _bindgen_ty_3 = _bindgen_ty_3::_SC_SHARED_MEMORY_OBJECTS;
pub const _SC_AIO_LISTIO_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_AIO_LISTIO_MAX;
pub const _SC_AIO_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_AIO_MAX;
pub const _SC_AIO_PRIO_DELTA_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_AIO_PRIO_DELTA_MAX;
pub const _SC_DELAYTIMER_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_DELAYTIMER_MAX;
pub const _SC_MQ_OPEN_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_MQ_OPEN_MAX;
pub const _SC_MQ_PRIO_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_MQ_PRIO_MAX;
pub const _SC_VERSION: _bindgen_ty_3 = _bindgen_ty_3::_SC_VERSION;
pub const _SC_PAGESIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_PAGESIZE;
pub const _SC_RTSIG_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_RTSIG_MAX;
pub const _SC_SEM_NSEMS_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_SEM_NSEMS_MAX;
pub const _SC_SEM_VALUE_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_SEM_VALUE_MAX;
pub const _SC_SIGQUEUE_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_SIGQUEUE_MAX;
pub const _SC_TIMER_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_TIMER_MAX;
pub const _SC_BC_BASE_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_BC_BASE_MAX;
pub const _SC_BC_DIM_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_BC_DIM_MAX;
pub const _SC_BC_SCALE_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_BC_SCALE_MAX;
pub const _SC_BC_STRING_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_BC_STRING_MAX;
pub const _SC_COLL_WEIGHTS_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_COLL_WEIGHTS_MAX;
pub const _SC_EQUIV_CLASS_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_EQUIV_CLASS_MAX;
pub const _SC_EXPR_NEST_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_EXPR_NEST_MAX;
pub const _SC_LINE_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_LINE_MAX;
pub const _SC_RE_DUP_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_RE_DUP_MAX;
pub const _SC_CHARCLASS_NAME_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_CHARCLASS_NAME_MAX;
pub const _SC_2_VERSION: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_VERSION;
pub const _SC_2_C_BIND: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_C_BIND;
pub const _SC_2_C_DEV: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_C_DEV;
pub const _SC_2_FORT_DEV: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_FORT_DEV;
pub const _SC_2_FORT_RUN: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_FORT_RUN;
pub const _SC_2_SW_DEV: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_SW_DEV;
pub const _SC_2_LOCALEDEF: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_LOCALEDEF;
pub const _SC_PII: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII;
pub const _SC_PII_XTI: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII_XTI;
pub const _SC_PII_SOCKET: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII_SOCKET;
pub const _SC_PII_INTERNET: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII_INTERNET;
pub const _SC_PII_OSI: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII_OSI;
pub const _SC_POLL: _bindgen_ty_3 = _bindgen_ty_3::_SC_POLL;
pub const _SC_SELECT: _bindgen_ty_3 = _bindgen_ty_3::_SC_SELECT;
pub const _SC_UIO_MAXIOV: _bindgen_ty_3 = _bindgen_ty_3::_SC_UIO_MAXIOV;
pub const _SC_IOV_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_UIO_MAXIOV;
pub const _SC_PII_INTERNET_STREAM: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII_INTERNET_STREAM;
pub const _SC_PII_INTERNET_DGRAM: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII_INTERNET_DGRAM;
pub const _SC_PII_OSI_COTS: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII_OSI_COTS;
pub const _SC_PII_OSI_CLTS: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII_OSI_CLTS;
pub const _SC_PII_OSI_M: _bindgen_ty_3 = _bindgen_ty_3::_SC_PII_OSI_M;
pub const _SC_T_IOV_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_T_IOV_MAX;
pub const _SC_THREADS: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREADS;
pub const _SC_THREAD_SAFE_FUNCTIONS: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_SAFE_FUNCTIONS;
pub const _SC_GETGR_R_SIZE_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_GETGR_R_SIZE_MAX;
pub const _SC_GETPW_R_SIZE_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_GETPW_R_SIZE_MAX;
pub const _SC_LOGIN_NAME_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_LOGIN_NAME_MAX;
pub const _SC_TTY_NAME_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_TTY_NAME_MAX;
pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: _bindgen_ty_3 =
    _bindgen_ty_3::_SC_THREAD_DESTRUCTOR_ITERATIONS;
pub const _SC_THREAD_KEYS_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_KEYS_MAX;
pub const _SC_THREAD_STACK_MIN: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_STACK_MIN;
pub const _SC_THREAD_THREADS_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_THREADS_MAX;
pub const _SC_THREAD_ATTR_STACKADDR: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_ATTR_STACKADDR;
pub const _SC_THREAD_ATTR_STACKSIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_ATTR_STACKSIZE;
pub const _SC_THREAD_PRIORITY_SCHEDULING: _bindgen_ty_3 =
    _bindgen_ty_3::_SC_THREAD_PRIORITY_SCHEDULING;
pub const _SC_THREAD_PRIO_INHERIT: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_PRIO_INHERIT;
pub const _SC_THREAD_PRIO_PROTECT: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_PRIO_PROTECT;
pub const _SC_THREAD_PROCESS_SHARED: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_PROCESS_SHARED;
pub const _SC_NPROCESSORS_CONF: _bindgen_ty_3 = _bindgen_ty_3::_SC_NPROCESSORS_CONF;
pub const _SC_NPROCESSORS_ONLN: _bindgen_ty_3 = _bindgen_ty_3::_SC_NPROCESSORS_ONLN;
pub const _SC_PHYS_PAGES: _bindgen_ty_3 = _bindgen_ty_3::_SC_PHYS_PAGES;
pub const _SC_AVPHYS_PAGES: _bindgen_ty_3 = _bindgen_ty_3::_SC_AVPHYS_PAGES;
pub const _SC_ATEXIT_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_ATEXIT_MAX;
pub const _SC_PASS_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_PASS_MAX;
pub const _SC_XOPEN_VERSION: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_VERSION;
pub const _SC_XOPEN_XCU_VERSION: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_XCU_VERSION;
pub const _SC_XOPEN_UNIX: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_UNIX;
pub const _SC_XOPEN_CRYPT: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_CRYPT;
pub const _SC_XOPEN_ENH_I18N: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_ENH_I18N;
pub const _SC_XOPEN_SHM: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_SHM;
pub const _SC_2_CHAR_TERM: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_CHAR_TERM;
pub const _SC_2_C_VERSION: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_C_VERSION;
pub const _SC_2_UPE: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_UPE;
pub const _SC_XOPEN_XPG2: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_XPG2;
pub const _SC_XOPEN_XPG3: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_XPG3;
pub const _SC_XOPEN_XPG4: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_XPG4;
pub const _SC_CHAR_BIT: _bindgen_ty_3 = _bindgen_ty_3::_SC_CHAR_BIT;
pub const _SC_CHAR_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_CHAR_MAX;
pub const _SC_CHAR_MIN: _bindgen_ty_3 = _bindgen_ty_3::_SC_CHAR_MIN;
pub const _SC_INT_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_INT_MAX;
pub const _SC_INT_MIN: _bindgen_ty_3 = _bindgen_ty_3::_SC_INT_MIN;
pub const _SC_LONG_BIT: _bindgen_ty_3 = _bindgen_ty_3::_SC_LONG_BIT;
pub const _SC_WORD_BIT: _bindgen_ty_3 = _bindgen_ty_3::_SC_WORD_BIT;
pub const _SC_MB_LEN_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_MB_LEN_MAX;
pub const _SC_NZERO: _bindgen_ty_3 = _bindgen_ty_3::_SC_NZERO;
pub const _SC_SSIZE_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_SSIZE_MAX;
pub const _SC_SCHAR_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_SCHAR_MAX;
pub const _SC_SCHAR_MIN: _bindgen_ty_3 = _bindgen_ty_3::_SC_SCHAR_MIN;
pub const _SC_SHRT_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_SHRT_MAX;
pub const _SC_SHRT_MIN: _bindgen_ty_3 = _bindgen_ty_3::_SC_SHRT_MIN;
pub const _SC_UCHAR_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_UCHAR_MAX;
pub const _SC_UINT_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_UINT_MAX;
pub const _SC_ULONG_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_ULONG_MAX;
pub const _SC_USHRT_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_USHRT_MAX;
pub const _SC_NL_ARGMAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_NL_ARGMAX;
pub const _SC_NL_LANGMAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_NL_LANGMAX;
pub const _SC_NL_MSGMAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_NL_MSGMAX;
pub const _SC_NL_NMAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_NL_NMAX;
pub const _SC_NL_SETMAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_NL_SETMAX;
pub const _SC_NL_TEXTMAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_NL_TEXTMAX;
pub const _SC_XBS5_ILP32_OFF32: _bindgen_ty_3 = _bindgen_ty_3::_SC_XBS5_ILP32_OFF32;
pub const _SC_XBS5_ILP32_OFFBIG: _bindgen_ty_3 = _bindgen_ty_3::_SC_XBS5_ILP32_OFFBIG;
pub const _SC_XBS5_LP64_OFF64: _bindgen_ty_3 = _bindgen_ty_3::_SC_XBS5_LP64_OFF64;
pub const _SC_XBS5_LPBIG_OFFBIG: _bindgen_ty_3 = _bindgen_ty_3::_SC_XBS5_LPBIG_OFFBIG;
pub const _SC_XOPEN_LEGACY: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_LEGACY;
pub const _SC_XOPEN_REALTIME: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_REALTIME;
pub const _SC_XOPEN_REALTIME_THREADS: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_REALTIME_THREADS;
pub const _SC_ADVISORY_INFO: _bindgen_ty_3 = _bindgen_ty_3::_SC_ADVISORY_INFO;
pub const _SC_BARRIERS: _bindgen_ty_3 = _bindgen_ty_3::_SC_BARRIERS;
pub const _SC_BASE: _bindgen_ty_3 = _bindgen_ty_3::_SC_BASE;
pub const _SC_C_LANG_SUPPORT: _bindgen_ty_3 = _bindgen_ty_3::_SC_C_LANG_SUPPORT;
pub const _SC_C_LANG_SUPPORT_R: _bindgen_ty_3 = _bindgen_ty_3::_SC_C_LANG_SUPPORT_R;
pub const _SC_CLOCK_SELECTION: _bindgen_ty_3 = _bindgen_ty_3::_SC_CLOCK_SELECTION;
pub const _SC_CPUTIME: _bindgen_ty_3 = _bindgen_ty_3::_SC_CPUTIME;
pub const _SC_THREAD_CPUTIME: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_CPUTIME;
pub const _SC_DEVICE_IO: _bindgen_ty_3 = _bindgen_ty_3::_SC_DEVICE_IO;
pub const _SC_DEVICE_SPECIFIC: _bindgen_ty_3 = _bindgen_ty_3::_SC_DEVICE_SPECIFIC;
pub const _SC_DEVICE_SPECIFIC_R: _bindgen_ty_3 = _bindgen_ty_3::_SC_DEVICE_SPECIFIC_R;
pub const _SC_FD_MGMT: _bindgen_ty_3 = _bindgen_ty_3::_SC_FD_MGMT;
pub const _SC_FIFO: _bindgen_ty_3 = _bindgen_ty_3::_SC_FIFO;
pub const _SC_PIPE: _bindgen_ty_3 = _bindgen_ty_3::_SC_PIPE;
pub const _SC_FILE_ATTRIBUTES: _bindgen_ty_3 = _bindgen_ty_3::_SC_FILE_ATTRIBUTES;
pub const _SC_FILE_LOCKING: _bindgen_ty_3 = _bindgen_ty_3::_SC_FILE_LOCKING;
pub const _SC_FILE_SYSTEM: _bindgen_ty_3 = _bindgen_ty_3::_SC_FILE_SYSTEM;
pub const _SC_MONOTONIC_CLOCK: _bindgen_ty_3 = _bindgen_ty_3::_SC_MONOTONIC_CLOCK;
pub const _SC_MULTI_PROCESS: _bindgen_ty_3 = _bindgen_ty_3::_SC_MULTI_PROCESS;
pub const _SC_SINGLE_PROCESS: _bindgen_ty_3 = _bindgen_ty_3::_SC_SINGLE_PROCESS;
pub const _SC_NETWORKING: _bindgen_ty_3 = _bindgen_ty_3::_SC_NETWORKING;
pub const _SC_READER_WRITER_LOCKS: _bindgen_ty_3 = _bindgen_ty_3::_SC_READER_WRITER_LOCKS;
pub const _SC_SPIN_LOCKS: _bindgen_ty_3 = _bindgen_ty_3::_SC_SPIN_LOCKS;
pub const _SC_REGEXP: _bindgen_ty_3 = _bindgen_ty_3::_SC_REGEXP;
pub const _SC_REGEX_VERSION: _bindgen_ty_3 = _bindgen_ty_3::_SC_REGEX_VERSION;
pub const _SC_SHELL: _bindgen_ty_3 = _bindgen_ty_3::_SC_SHELL;
pub const _SC_SIGNALS: _bindgen_ty_3 = _bindgen_ty_3::_SC_SIGNALS;
pub const _SC_SPAWN: _bindgen_ty_3 = _bindgen_ty_3::_SC_SPAWN;
pub const _SC_SPORADIC_SERVER: _bindgen_ty_3 = _bindgen_ty_3::_SC_SPORADIC_SERVER;
pub const _SC_THREAD_SPORADIC_SERVER: _bindgen_ty_3 = _bindgen_ty_3::_SC_THREAD_SPORADIC_SERVER;
pub const _SC_SYSTEM_DATABASE: _bindgen_ty_3 = _bindgen_ty_3::_SC_SYSTEM_DATABASE;
pub const _SC_SYSTEM_DATABASE_R: _bindgen_ty_3 = _bindgen_ty_3::_SC_SYSTEM_DATABASE_R;
pub const _SC_TIMEOUTS: _bindgen_ty_3 = _bindgen_ty_3::_SC_TIMEOUTS;
pub const _SC_TYPED_MEMORY_OBJECTS: _bindgen_ty_3 = _bindgen_ty_3::_SC_TYPED_MEMORY_OBJECTS;
pub const _SC_USER_GROUPS: _bindgen_ty_3 = _bindgen_ty_3::_SC_USER_GROUPS;
pub const _SC_USER_GROUPS_R: _bindgen_ty_3 = _bindgen_ty_3::_SC_USER_GROUPS_R;
pub const _SC_2_PBS: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_PBS;
pub const _SC_2_PBS_ACCOUNTING: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_PBS_ACCOUNTING;
pub const _SC_2_PBS_LOCATE: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_PBS_LOCATE;
pub const _SC_2_PBS_MESSAGE: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_PBS_MESSAGE;
pub const _SC_2_PBS_TRACK: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_PBS_TRACK;
pub const _SC_SYMLOOP_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_SYMLOOP_MAX;
pub const _SC_STREAMS: _bindgen_ty_3 = _bindgen_ty_3::_SC_STREAMS;
pub const _SC_2_PBS_CHECKPOINT: _bindgen_ty_3 = _bindgen_ty_3::_SC_2_PBS_CHECKPOINT;
pub const _SC_V6_ILP32_OFF32: _bindgen_ty_3 = _bindgen_ty_3::_SC_V6_ILP32_OFF32;
pub const _SC_V6_ILP32_OFFBIG: _bindgen_ty_3 = _bindgen_ty_3::_SC_V6_ILP32_OFFBIG;
pub const _SC_V6_LP64_OFF64: _bindgen_ty_3 = _bindgen_ty_3::_SC_V6_LP64_OFF64;
pub const _SC_V6_LPBIG_OFFBIG: _bindgen_ty_3 = _bindgen_ty_3::_SC_V6_LPBIG_OFFBIG;
pub const _SC_HOST_NAME_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_HOST_NAME_MAX;
pub const _SC_TRACE: _bindgen_ty_3 = _bindgen_ty_3::_SC_TRACE;
pub const _SC_TRACE_EVENT_FILTER: _bindgen_ty_3 = _bindgen_ty_3::_SC_TRACE_EVENT_FILTER;
pub const _SC_TRACE_INHERIT: _bindgen_ty_3 = _bindgen_ty_3::_SC_TRACE_INHERIT;
pub const _SC_TRACE_LOG: _bindgen_ty_3 = _bindgen_ty_3::_SC_TRACE_LOG;
pub const _SC_LEVEL1_ICACHE_SIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL1_ICACHE_SIZE;
pub const _SC_LEVEL1_ICACHE_ASSOC: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL1_ICACHE_ASSOC;
pub const _SC_LEVEL1_ICACHE_LINESIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL1_ICACHE_LINESIZE;
pub const _SC_LEVEL1_DCACHE_SIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL1_DCACHE_SIZE;
pub const _SC_LEVEL1_DCACHE_ASSOC: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL1_DCACHE_ASSOC;
pub const _SC_LEVEL1_DCACHE_LINESIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL1_DCACHE_LINESIZE;
pub const _SC_LEVEL2_CACHE_SIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL2_CACHE_SIZE;
pub const _SC_LEVEL2_CACHE_ASSOC: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL2_CACHE_ASSOC;
pub const _SC_LEVEL2_CACHE_LINESIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL2_CACHE_LINESIZE;
pub const _SC_LEVEL3_CACHE_SIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL3_CACHE_SIZE;
pub const _SC_LEVEL3_CACHE_ASSOC: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL3_CACHE_ASSOC;
pub const _SC_LEVEL3_CACHE_LINESIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL3_CACHE_LINESIZE;
pub const _SC_LEVEL4_CACHE_SIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL4_CACHE_SIZE;
pub const _SC_LEVEL4_CACHE_ASSOC: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL4_CACHE_ASSOC;
pub const _SC_LEVEL4_CACHE_LINESIZE: _bindgen_ty_3 = _bindgen_ty_3::_SC_LEVEL4_CACHE_LINESIZE;
pub const _SC_IPV6: _bindgen_ty_3 = _bindgen_ty_3::_SC_IPV6;
pub const _SC_RAW_SOCKETS: _bindgen_ty_3 = _bindgen_ty_3::_SC_RAW_SOCKETS;
pub const _SC_V7_ILP32_OFF32: _bindgen_ty_3 = _bindgen_ty_3::_SC_V7_ILP32_OFF32;
pub const _SC_V7_ILP32_OFFBIG: _bindgen_ty_3 = _bindgen_ty_3::_SC_V7_ILP32_OFFBIG;
pub const _SC_V7_LP64_OFF64: _bindgen_ty_3 = _bindgen_ty_3::_SC_V7_LP64_OFF64;
pub const _SC_V7_LPBIG_OFFBIG: _bindgen_ty_3 = _bindgen_ty_3::_SC_V7_LPBIG_OFFBIG;
pub const _SC_SS_REPL_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_SS_REPL_MAX;
pub const _SC_TRACE_EVENT_NAME_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_TRACE_EVENT_NAME_MAX;
pub const _SC_TRACE_NAME_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_TRACE_NAME_MAX;
pub const _SC_TRACE_SYS_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_TRACE_SYS_MAX;
pub const _SC_TRACE_USER_EVENT_MAX: _bindgen_ty_3 = _bindgen_ty_3::_SC_TRACE_USER_EVENT_MAX;
pub const _SC_XOPEN_STREAMS: _bindgen_ty_3 = _bindgen_ty_3::_SC_XOPEN_STREAMS;
pub const _SC_THREAD_ROBUST_PRIO_INHERIT: _bindgen_ty_3 =
    _bindgen_ty_3::_SC_THREAD_ROBUST_PRIO_INHERIT;
pub const _SC_THREAD_ROBUST_PRIO_PROTECT: _bindgen_ty_3 =
    _bindgen_ty_3::_SC_THREAD_ROBUST_PRIO_PROTECT;
pub const _SC_MINSIGSTKSZ: _bindgen_ty_3 = _bindgen_ty_3::_SC_MINSIGSTKSZ;
pub const _SC_SIGSTKSZ: _bindgen_ty_3 = _bindgen_ty_3::_SC_SIGSTKSZ;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_3 {
    _SC_ARG_MAX = 0,
    _SC_CHILD_MAX = 1,
    _SC_CLK_TCK = 2,
    _SC_NGROUPS_MAX = 3,
    _SC_OPEN_MAX = 4,
    _SC_STREAM_MAX = 5,
    _SC_TZNAME_MAX = 6,
    _SC_JOB_CONTROL = 7,
    _SC_SAVED_IDS = 8,
    _SC_REALTIME_SIGNALS = 9,
    _SC_PRIORITY_SCHEDULING = 10,
    _SC_TIMERS = 11,
    _SC_ASYNCHRONOUS_IO = 12,
    _SC_PRIORITIZED_IO = 13,
    _SC_SYNCHRONIZED_IO = 14,
    _SC_FSYNC = 15,
    _SC_MAPPED_FILES = 16,
    _SC_MEMLOCK = 17,
    _SC_MEMLOCK_RANGE = 18,
    _SC_MEMORY_PROTECTION = 19,
    _SC_MESSAGE_PASSING = 20,
    _SC_SEMAPHORES = 21,
    _SC_SHARED_MEMORY_OBJECTS = 22,
    _SC_AIO_LISTIO_MAX = 23,
    _SC_AIO_MAX = 24,
    _SC_AIO_PRIO_DELTA_MAX = 25,
    _SC_DELAYTIMER_MAX = 26,
    _SC_MQ_OPEN_MAX = 27,
    _SC_MQ_PRIO_MAX = 28,
    _SC_VERSION = 29,
    _SC_PAGESIZE = 30,
    _SC_RTSIG_MAX = 31,
    _SC_SEM_NSEMS_MAX = 32,
    _SC_SEM_VALUE_MAX = 33,
    _SC_SIGQUEUE_MAX = 34,
    _SC_TIMER_MAX = 35,
    _SC_BC_BASE_MAX = 36,
    _SC_BC_DIM_MAX = 37,
    _SC_BC_SCALE_MAX = 38,
    _SC_BC_STRING_MAX = 39,
    _SC_COLL_WEIGHTS_MAX = 40,
    _SC_EQUIV_CLASS_MAX = 41,
    _SC_EXPR_NEST_MAX = 42,
    _SC_LINE_MAX = 43,
    _SC_RE_DUP_MAX = 44,
    _SC_CHARCLASS_NAME_MAX = 45,
    _SC_2_VERSION = 46,
    _SC_2_C_BIND = 47,
    _SC_2_C_DEV = 48,
    _SC_2_FORT_DEV = 49,
    _SC_2_FORT_RUN = 50,
    _SC_2_SW_DEV = 51,
    _SC_2_LOCALEDEF = 52,
    _SC_PII = 53,
    _SC_PII_XTI = 54,
    _SC_PII_SOCKET = 55,
    _SC_PII_INTERNET = 56,
    _SC_PII_OSI = 57,
    _SC_POLL = 58,
    _SC_SELECT = 59,
    _SC_UIO_MAXIOV = 60,
    _SC_PII_INTERNET_STREAM = 61,
    _SC_PII_INTERNET_DGRAM = 62,
    _SC_PII_OSI_COTS = 63,
    _SC_PII_OSI_CLTS = 64,
    _SC_PII_OSI_M = 65,
    _SC_T_IOV_MAX = 66,
    _SC_THREADS = 67,
    _SC_THREAD_SAFE_FUNCTIONS = 68,
    _SC_GETGR_R_SIZE_MAX = 69,
    _SC_GETPW_R_SIZE_MAX = 70,
    _SC_LOGIN_NAME_MAX = 71,
    _SC_TTY_NAME_MAX = 72,
    _SC_THREAD_DESTRUCTOR_ITERATIONS = 73,
    _SC_THREAD_KEYS_MAX = 74,
    _SC_THREAD_STACK_MIN = 75,
    _SC_THREAD_THREADS_MAX = 76,
    _SC_THREAD_ATTR_STACKADDR = 77,
    _SC_THREAD_ATTR_STACKSIZE = 78,
    _SC_THREAD_PRIORITY_SCHEDULING = 79,
    _SC_THREAD_PRIO_INHERIT = 80,
    _SC_THREAD_PRIO_PROTECT = 81,
    _SC_THREAD_PROCESS_SHARED = 82,
    _SC_NPROCESSORS_CONF = 83,
    _SC_NPROCESSORS_ONLN = 84,
    _SC_PHYS_PAGES = 85,
    _SC_AVPHYS_PAGES = 86,
    _SC_ATEXIT_MAX = 87,
    _SC_PASS_MAX = 88,
    _SC_XOPEN_VERSION = 89,
    _SC_XOPEN_XCU_VERSION = 90,
    _SC_XOPEN_UNIX = 91,
    _SC_XOPEN_CRYPT = 92,
    _SC_XOPEN_ENH_I18N = 93,
    _SC_XOPEN_SHM = 94,
    _SC_2_CHAR_TERM = 95,
    _SC_2_C_VERSION = 96,
    _SC_2_UPE = 97,
    _SC_XOPEN_XPG2 = 98,
    _SC_XOPEN_XPG3 = 99,
    _SC_XOPEN_XPG4 = 100,
    _SC_CHAR_BIT = 101,
    _SC_CHAR_MAX = 102,
    _SC_CHAR_MIN = 103,
    _SC_INT_MAX = 104,
    _SC_INT_MIN = 105,
    _SC_LONG_BIT = 106,
    _SC_WORD_BIT = 107,
    _SC_MB_LEN_MAX = 108,
    _SC_NZERO = 109,
    _SC_SSIZE_MAX = 110,
    _SC_SCHAR_MAX = 111,
    _SC_SCHAR_MIN = 112,
    _SC_SHRT_MAX = 113,
    _SC_SHRT_MIN = 114,
    _SC_UCHAR_MAX = 115,
    _SC_UINT_MAX = 116,
    _SC_ULONG_MAX = 117,
    _SC_USHRT_MAX = 118,
    _SC_NL_ARGMAX = 119,
    _SC_NL_LANGMAX = 120,
    _SC_NL_MSGMAX = 121,
    _SC_NL_NMAX = 122,
    _SC_NL_SETMAX = 123,
    _SC_NL_TEXTMAX = 124,
    _SC_XBS5_ILP32_OFF32 = 125,
    _SC_XBS5_ILP32_OFFBIG = 126,
    _SC_XBS5_LP64_OFF64 = 127,
    _SC_XBS5_LPBIG_OFFBIG = 128,
    _SC_XOPEN_LEGACY = 129,
    _SC_XOPEN_REALTIME = 130,
    _SC_XOPEN_REALTIME_THREADS = 131,
    _SC_ADVISORY_INFO = 132,
    _SC_BARRIERS = 133,
    _SC_BASE = 134,
    _SC_C_LANG_SUPPORT = 135,
    _SC_C_LANG_SUPPORT_R = 136,
    _SC_CLOCK_SELECTION = 137,
    _SC_CPUTIME = 138,
    _SC_THREAD_CPUTIME = 139,
    _SC_DEVICE_IO = 140,
    _SC_DEVICE_SPECIFIC = 141,
    _SC_DEVICE_SPECIFIC_R = 142,
    _SC_FD_MGMT = 143,
    _SC_FIFO = 144,
    _SC_PIPE = 145,
    _SC_FILE_ATTRIBUTES = 146,
    _SC_FILE_LOCKING = 147,
    _SC_FILE_SYSTEM = 148,
    _SC_MONOTONIC_CLOCK = 149,
    _SC_MULTI_PROCESS = 150,
    _SC_SINGLE_PROCESS = 151,
    _SC_NETWORKING = 152,
    _SC_READER_WRITER_LOCKS = 153,
    _SC_SPIN_LOCKS = 154,
    _SC_REGEXP = 155,
    _SC_REGEX_VERSION = 156,
    _SC_SHELL = 157,
    _SC_SIGNALS = 158,
    _SC_SPAWN = 159,
    _SC_SPORADIC_SERVER = 160,
    _SC_THREAD_SPORADIC_SERVER = 161,
    _SC_SYSTEM_DATABASE = 162,
    _SC_SYSTEM_DATABASE_R = 163,
    _SC_TIMEOUTS = 164,
    _SC_TYPED_MEMORY_OBJECTS = 165,
    _SC_USER_GROUPS = 166,
    _SC_USER_GROUPS_R = 167,
    _SC_2_PBS = 168,
    _SC_2_PBS_ACCOUNTING = 169,
    _SC_2_PBS_LOCATE = 170,
    _SC_2_PBS_MESSAGE = 171,
    _SC_2_PBS_TRACK = 172,
    _SC_SYMLOOP_MAX = 173,
    _SC_STREAMS = 174,
    _SC_2_PBS_CHECKPOINT = 175,
    _SC_V6_ILP32_OFF32 = 176,
    _SC_V6_ILP32_OFFBIG = 177,
    _SC_V6_LP64_OFF64 = 178,
    _SC_V6_LPBIG_OFFBIG = 179,
    _SC_HOST_NAME_MAX = 180,
    _SC_TRACE = 181,
    _SC_TRACE_EVENT_FILTER = 182,
    _SC_TRACE_INHERIT = 183,
    _SC_TRACE_LOG = 184,
    _SC_LEVEL1_ICACHE_SIZE = 185,
    _SC_LEVEL1_ICACHE_ASSOC = 186,
    _SC_LEVEL1_ICACHE_LINESIZE = 187,
    _SC_LEVEL1_DCACHE_SIZE = 188,
    _SC_LEVEL1_DCACHE_ASSOC = 189,
    _SC_LEVEL1_DCACHE_LINESIZE = 190,
    _SC_LEVEL2_CACHE_SIZE = 191,
    _SC_LEVEL2_CACHE_ASSOC = 192,
    _SC_LEVEL2_CACHE_LINESIZE = 193,
    _SC_LEVEL3_CACHE_SIZE = 194,
    _SC_LEVEL3_CACHE_ASSOC = 195,
    _SC_LEVEL3_CACHE_LINESIZE = 196,
    _SC_LEVEL4_CACHE_SIZE = 197,
    _SC_LEVEL4_CACHE_ASSOC = 198,
    _SC_LEVEL4_CACHE_LINESIZE = 199,
    _SC_IPV6 = 235,
    _SC_RAW_SOCKETS = 236,
    _SC_V7_ILP32_OFF32 = 237,
    _SC_V7_ILP32_OFFBIG = 238,
    _SC_V7_LP64_OFF64 = 239,
    _SC_V7_LPBIG_OFFBIG = 240,
    _SC_SS_REPL_MAX = 241,
    _SC_TRACE_EVENT_NAME_MAX = 242,
    _SC_TRACE_NAME_MAX = 243,
    _SC_TRACE_SYS_MAX = 244,
    _SC_TRACE_USER_EVENT_MAX = 245,
    _SC_XOPEN_STREAMS = 246,
    _SC_THREAD_ROBUST_PRIO_INHERIT = 247,
    _SC_THREAD_ROBUST_PRIO_PROTECT = 248,
    _SC_MINSIGSTKSZ = 249,
    _SC_SIGSTKSZ = 250,
}
pub const _CS_PATH: _bindgen_ty_4 = _bindgen_ty_4::_CS_PATH;
pub const _CS_V6_WIDTH_RESTRICTED_ENVS: _bindgen_ty_4 = _bindgen_ty_4::_CS_V6_WIDTH_RESTRICTED_ENVS;
pub const _CS_GNU_LIBC_VERSION: _bindgen_ty_4 = _bindgen_ty_4::_CS_GNU_LIBC_VERSION;
pub const _CS_GNU_LIBPTHREAD_VERSION: _bindgen_ty_4 = _bindgen_ty_4::_CS_GNU_LIBPTHREAD_VERSION;
pub const _CS_V5_WIDTH_RESTRICTED_ENVS: _bindgen_ty_4 = _bindgen_ty_4::_CS_V5_WIDTH_RESTRICTED_ENVS;
pub const _CS_V7_WIDTH_RESTRICTED_ENVS: _bindgen_ty_4 = _bindgen_ty_4::_CS_V7_WIDTH_RESTRICTED_ENVS;
pub const _CS_LFS_CFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_LFS_CFLAGS;
pub const _CS_LFS_LDFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_LFS_LDFLAGS;
pub const _CS_LFS_LIBS: _bindgen_ty_4 = _bindgen_ty_4::_CS_LFS_LIBS;
pub const _CS_LFS_LINTFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_LFS_LINTFLAGS;
pub const _CS_LFS64_CFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_LFS64_CFLAGS;
pub const _CS_LFS64_LDFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_LFS64_LDFLAGS;
pub const _CS_LFS64_LIBS: _bindgen_ty_4 = _bindgen_ty_4::_CS_LFS64_LIBS;
pub const _CS_LFS64_LINTFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_LFS64_LINTFLAGS;
pub const _CS_XBS5_ILP32_OFF32_CFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_ILP32_OFF32_CFLAGS;
pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_ILP32_OFF32_LDFLAGS;
pub const _CS_XBS5_ILP32_OFF32_LIBS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_ILP32_OFF32_LIBS;
pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_XBS5_ILP32_OFF32_LINTFLAGS;
pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_ILP32_OFFBIG_CFLAGS;
pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_XBS5_ILP32_OFFBIG_LDFLAGS;
pub const _CS_XBS5_ILP32_OFFBIG_LIBS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_ILP32_OFFBIG_LIBS;
pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_XBS5_ILP32_OFFBIG_LINTFLAGS;
pub const _CS_XBS5_LP64_OFF64_CFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_LP64_OFF64_CFLAGS;
pub const _CS_XBS5_LP64_OFF64_LDFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_LP64_OFF64_LDFLAGS;
pub const _CS_XBS5_LP64_OFF64_LIBS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_LP64_OFF64_LIBS;
pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_XBS5_LP64_OFF64_LINTFLAGS;
pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_LPBIG_OFFBIG_CFLAGS;
pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_XBS5_LPBIG_OFFBIG_LDFLAGS;
pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: _bindgen_ty_4 = _bindgen_ty_4::_CS_XBS5_LPBIG_OFFBIG_LIBS;
pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_XBS5_LPBIG_OFFBIG_LINTFLAGS;
pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_ILP32_OFF32_CFLAGS;
pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_ILP32_OFF32_LDFLAGS;
pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_ILP32_OFF32_LIBS;
pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_ILP32_OFF32_LINTFLAGS;
pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_ILP32_OFFBIG_CFLAGS;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_ILP32_OFFBIG_LIBS;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS;
pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_LP64_OFF64_CFLAGS;
pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_LP64_OFF64_LDFLAGS;
pub const _CS_POSIX_V6_LP64_OFF64_LIBS: _bindgen_ty_4 = _bindgen_ty_4::_CS_POSIX_V6_LP64_OFF64_LIBS;
pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_LP64_OFF64_LINTFLAGS;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_LPBIG_OFFBIG_LIBS;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS;
pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_ILP32_OFF32_CFLAGS;
pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_ILP32_OFF32_LDFLAGS;
pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_ILP32_OFF32_LIBS;
pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_ILP32_OFF32_LINTFLAGS;
pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_ILP32_OFFBIG_CFLAGS;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_ILP32_OFFBIG_LIBS;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS;
pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_LP64_OFF64_CFLAGS;
pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_LP64_OFF64_LDFLAGS;
pub const _CS_POSIX_V7_LP64_OFF64_LIBS: _bindgen_ty_4 = _bindgen_ty_4::_CS_POSIX_V7_LP64_OFF64_LIBS;
pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_LP64_OFF64_LINTFLAGS;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_LPBIG_OFFBIG_LIBS;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_4 =
    _bindgen_ty_4::_CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS;
pub const _CS_V6_ENV: _bindgen_ty_4 = _bindgen_ty_4::_CS_V6_ENV;
pub const _CS_V7_ENV: _bindgen_ty_4 = _bindgen_ty_4::_CS_V7_ENV;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_4 {
    _CS_PATH = 0,
    _CS_V6_WIDTH_RESTRICTED_ENVS = 1,
    _CS_GNU_LIBC_VERSION = 2,
    _CS_GNU_LIBPTHREAD_VERSION = 3,
    _CS_V5_WIDTH_RESTRICTED_ENVS = 4,
    _CS_V7_WIDTH_RESTRICTED_ENVS = 5,
    _CS_LFS_CFLAGS = 1000,
    _CS_LFS_LDFLAGS = 1001,
    _CS_LFS_LIBS = 1002,
    _CS_LFS_LINTFLAGS = 1003,
    _CS_LFS64_CFLAGS = 1004,
    _CS_LFS64_LDFLAGS = 1005,
    _CS_LFS64_LIBS = 1006,
    _CS_LFS64_LINTFLAGS = 1007,
    _CS_XBS5_ILP32_OFF32_CFLAGS = 1100,
    _CS_XBS5_ILP32_OFF32_LDFLAGS = 1101,
    _CS_XBS5_ILP32_OFF32_LIBS = 1102,
    _CS_XBS5_ILP32_OFF32_LINTFLAGS = 1103,
    _CS_XBS5_ILP32_OFFBIG_CFLAGS = 1104,
    _CS_XBS5_ILP32_OFFBIG_LDFLAGS = 1105,
    _CS_XBS5_ILP32_OFFBIG_LIBS = 1106,
    _CS_XBS5_ILP32_OFFBIG_LINTFLAGS = 1107,
    _CS_XBS5_LP64_OFF64_CFLAGS = 1108,
    _CS_XBS5_LP64_OFF64_LDFLAGS = 1109,
    _CS_XBS5_LP64_OFF64_LIBS = 1110,
    _CS_XBS5_LP64_OFF64_LINTFLAGS = 1111,
    _CS_XBS5_LPBIG_OFFBIG_CFLAGS = 1112,
    _CS_XBS5_LPBIG_OFFBIG_LDFLAGS = 1113,
    _CS_XBS5_LPBIG_OFFBIG_LIBS = 1114,
    _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS = 1115,
    _CS_POSIX_V6_ILP32_OFF32_CFLAGS = 1116,
    _CS_POSIX_V6_ILP32_OFF32_LDFLAGS = 1117,
    _CS_POSIX_V6_ILP32_OFF32_LIBS = 1118,
    _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS = 1119,
    _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS = 1120,
    _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS = 1121,
    _CS_POSIX_V6_ILP32_OFFBIG_LIBS = 1122,
    _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS = 1123,
    _CS_POSIX_V6_LP64_OFF64_CFLAGS = 1124,
    _CS_POSIX_V6_LP64_OFF64_LDFLAGS = 1125,
    _CS_POSIX_V6_LP64_OFF64_LIBS = 1126,
    _CS_POSIX_V6_LP64_OFF64_LINTFLAGS = 1127,
    _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS = 1128,
    _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS = 1129,
    _CS_POSIX_V6_LPBIG_OFFBIG_LIBS = 1130,
    _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS = 1131,
    _CS_POSIX_V7_ILP32_OFF32_CFLAGS = 1132,
    _CS_POSIX_V7_ILP32_OFF32_LDFLAGS = 1133,
    _CS_POSIX_V7_ILP32_OFF32_LIBS = 1134,
    _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS = 1135,
    _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS = 1136,
    _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS = 1137,
    _CS_POSIX_V7_ILP32_OFFBIG_LIBS = 1138,
    _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS = 1139,
    _CS_POSIX_V7_LP64_OFF64_CFLAGS = 1140,
    _CS_POSIX_V7_LP64_OFF64_LDFLAGS = 1141,
    _CS_POSIX_V7_LP64_OFF64_LIBS = 1142,
    _CS_POSIX_V7_LP64_OFF64_LINTFLAGS = 1143,
    _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS = 1144,
    _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS = 1145,
    _CS_POSIX_V7_LPBIG_OFFBIG_LIBS = 1146,
    _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS = 1147,
    _CS_V6_ENV = 1148,
    _CS_V7_ENV = 1149,
}
unsafe extern "C" {
    pub fn pathconf(
        __path: *const ::std::os::raw::c_char,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn fpathconf(
        __fd: ::std::os::raw::c_int,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn sysconf(__name: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn confstr(
        __name: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn getpid() -> __pid_t;
}
unsafe extern "C" {
    pub fn getppid() -> __pid_t;
}
unsafe extern "C" {
    pub fn getpgrp() -> __pid_t;
}
unsafe extern "C" {
    pub fn __getpgid(__pid: __pid_t) -> __pid_t;
}
unsafe extern "C" {
    pub fn getpgid(__pid: __pid_t) -> __pid_t;
}
unsafe extern "C" {
    pub fn setpgid(__pid: __pid_t, __pgid: __pid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setpgrp() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setsid() -> __pid_t;
}
unsafe extern "C" {
    pub fn getsid(__pid: __pid_t) -> __pid_t;
}
unsafe extern "C" {
    pub fn getuid() -> __uid_t;
}
unsafe extern "C" {
    pub fn geteuid() -> __uid_t;
}
unsafe extern "C" {
    pub fn getgid() -> __gid_t;
}
unsafe extern "C" {
    pub fn getegid() -> __gid_t;
}
unsafe extern "C" {
    pub fn getgroups(__size: ::std::os::raw::c_int, __list: *mut __gid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setreuid(__ruid: __uid_t, __euid: __uid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seteuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setgid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setregid(__rgid: __gid_t, __egid: __gid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setegid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fork() -> __pid_t;
}
unsafe extern "C" {
    pub fn vfork() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ttyname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ttyname_r(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isatty(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ttyslot() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn link(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn linkat(
        __fromfd: ::std::os::raw::c_int,
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn symlink(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn readlink(
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn symlinkat(
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn readlinkat(
        __fd: ::std::os::raw::c_int,
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn unlink(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unlinkat(
        __fd: ::std::os::raw::c_int,
        __name: *const ::std::os::raw::c_char,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rmdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tcgetpgrp(__fd: ::std::os::raw::c_int) -> __pid_t;
}
unsafe extern "C" {
    pub fn tcsetpgrp(__fd: ::std::os::raw::c_int, __pgrp_id: __pid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getlogin() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getlogin_r(
        __name: *mut ::std::os::raw::c_char,
        __name_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setlogin(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getopt(
        ___argc: ::std::os::raw::c_int,
        ___argv: *const *mut ::std::os::raw::c_char,
        __shortopts: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gethostname(__name: *mut ::std::os::raw::c_char, __len: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sethostname(
        __name: *const ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sethostid(__id: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getdomainname(
        __name: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setdomainname(
        __name: *const ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vhangup() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn revoke(__file: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn profil(
        __sample_buffer: *mut ::std::os::raw::c_ushort,
        __size: usize,
        __offset: usize,
        __scale: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acct(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getusershell() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn endusershell();
}
unsafe extern "C" {
    pub fn setusershell();
}
unsafe extern "C" {
    pub fn daemon(
        __nochdir: ::std::os::raw::c_int,
        __noclose: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn chroot(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getpass(__prompt: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fsync(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gethostid() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn sync();
}
unsafe extern "C" {
    pub fn getpagesize() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getdtablesize() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn truncate(
        __file: *const ::std::os::raw::c_char,
        __length: __off_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftruncate(__fd: ::std::os::raw::c_int, __length: __off_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn brk(__addr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sbrk(__delta: isize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn syscall(__sysno: ::std::os::raw::c_long, ...) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lockf(
        __fd: ::std::os::raw::c_int,
        __cmd: ::std::os::raw::c_int,
        __len: __off_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fdatasync(__fildes: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn crypt(
        __key: *const ::std::os::raw::c_char,
        __salt: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getentropy(
        __buffer: *mut ::std::os::raw::c_void,
        __length: usize,
    ) -> ::std::os::raw::c_int;
}
pub type pmix_nspace_t = [::std::os::raw::c_char; 256usize];
pub type pmix_key_t = [::std::os::raw::c_char; 512usize];
pub type pmix_rank_t = u32;
pub type pmix_proc_state_t = u8;
pub type pmix_job_state_t = u8;
pub type pmix_status_t = ::std::os::raw::c_int;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum pmix_value_cmp_t {
    PMIX_EQUAL = 0,
    PMIX_VALUE1_GREATER = 1,
    PMIX_VALUE2_GREATER = 2,
    PMIX_VALUE_TYPE_DIFFERENT = 3,
    PMIX_VALUE_INCOMPATIBLE_OBJECTS = 4,
    PMIX_VALUE_COMPARISON_NOT_AVAIL = 5,
}
pub type pmix_data_type_t = u16;
pub type pmix_scope_t = u8;
pub type pmix_data_range_t = u8;
pub type pmix_persistence_t = u8;
pub type pmix_info_directives_t = u32;
pub type pmix_alloc_directive_t = u8;
pub type pmix_resource_block_directive_t = u8;
pub type pmix_iof_channel_t = u16;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum pmix_group_opt_t {
    PMIX_GROUP_DECLINE = 0,
    PMIX_GROUP_ACCEPT = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum pmix_group_operation_t {
    PMIX_GROUP_CONSTRUCT = 0,
    PMIX_GROUP_DESTRUCT = 1,
    PMIX_GROUP_NONE = 2,
}
pub type pmix_storage_medium_t = u64;
pub type pmix_storage_accessibility_t = u64;
pub type pmix_storage_persistence_t = u64;
pub type pmix_storage_access_type_t = u16;
pub type pmix_coord_view_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_coord {
    pub view: pmix_coord_view_t,
    pub coord: *mut u32,
    pub dims: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_coord"][::std::mem::size_of::<pmix_coord>() - 24usize];
    ["Alignment of pmix_coord"][::std::mem::align_of::<pmix_coord>() - 8usize];
    ["Offset of field: pmix_coord::view"][::std::mem::offset_of!(pmix_coord, view) - 0usize];
    ["Offset of field: pmix_coord::coord"][::std::mem::offset_of!(pmix_coord, coord) - 8usize];
    ["Offset of field: pmix_coord::dims"][::std::mem::offset_of!(pmix_coord, dims) - 16usize];
};
pub type pmix_coord_t = pmix_coord;
pub type pmix_link_state_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_cpuset_t {
    pub source: *mut ::std::os::raw::c_char,
    pub bitmap: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_cpuset_t"][::std::mem::size_of::<pmix_cpuset_t>() - 16usize];
    ["Alignment of pmix_cpuset_t"][::std::mem::align_of::<pmix_cpuset_t>() - 8usize];
    ["Offset of field: pmix_cpuset_t::source"]
        [::std::mem::offset_of!(pmix_cpuset_t, source) - 0usize];
    ["Offset of field: pmix_cpuset_t::bitmap"]
        [::std::mem::offset_of!(pmix_cpuset_t, bitmap) - 8usize];
};
pub type pmix_bind_envelope_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_topology_t {
    pub source: *mut ::std::os::raw::c_char,
    pub topology: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_topology_t"][::std::mem::size_of::<pmix_topology_t>() - 16usize];
    ["Alignment of pmix_topology_t"][::std::mem::align_of::<pmix_topology_t>() - 8usize];
    ["Offset of field: pmix_topology_t::source"]
        [::std::mem::offset_of!(pmix_topology_t, source) - 0usize];
    ["Offset of field: pmix_topology_t::topology"]
        [::std::mem::offset_of!(pmix_topology_t, topology) - 8usize];
};
pub type pmix_locality_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_geometry {
    pub fabric: usize,
    pub uuid: *mut ::std::os::raw::c_char,
    pub osname: *mut ::std::os::raw::c_char,
    pub coordinates: *mut pmix_coord_t,
    pub ncoords: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_geometry"][::std::mem::size_of::<pmix_geometry>() - 40usize];
    ["Alignment of pmix_geometry"][::std::mem::align_of::<pmix_geometry>() - 8usize];
    ["Offset of field: pmix_geometry::fabric"]
        [::std::mem::offset_of!(pmix_geometry, fabric) - 0usize];
    ["Offset of field: pmix_geometry::uuid"][::std::mem::offset_of!(pmix_geometry, uuid) - 8usize];
    ["Offset of field: pmix_geometry::osname"]
        [::std::mem::offset_of!(pmix_geometry, osname) - 16usize];
    ["Offset of field: pmix_geometry::coordinates"]
        [::std::mem::offset_of!(pmix_geometry, coordinates) - 24usize];
    ["Offset of field: pmix_geometry::ncoords"]
        [::std::mem::offset_of!(pmix_geometry, ncoords) - 32usize];
};
pub type pmix_geometry_t = pmix_geometry;
pub type pmix_device_type_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_device {
    pub uuid: *mut ::std::os::raw::c_char,
    pub osname: *mut ::std::os::raw::c_char,
    pub type_: pmix_device_type_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_device"][::std::mem::size_of::<pmix_device>() - 24usize];
    ["Alignment of pmix_device"][::std::mem::align_of::<pmix_device>() - 8usize];
    ["Offset of field: pmix_device::uuid"][::std::mem::offset_of!(pmix_device, uuid) - 0usize];
    ["Offset of field: pmix_device::osname"][::std::mem::offset_of!(pmix_device, osname) - 8usize];
    ["Offset of field: pmix_device::type_"][::std::mem::offset_of!(pmix_device, type_) - 16usize];
};
pub type pmix_device_t = pmix_device;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_resource_unit {
    pub type_: pmix_device_type_t,
    pub count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_resource_unit"][::std::mem::size_of::<pmix_resource_unit>() - 16usize];
    ["Alignment of pmix_resource_unit"][::std::mem::align_of::<pmix_resource_unit>() - 8usize];
    ["Offset of field: pmix_resource_unit::type_"]
        [::std::mem::offset_of!(pmix_resource_unit, type_) - 0usize];
    ["Offset of field: pmix_resource_unit::count"]
        [::std::mem::offset_of!(pmix_resource_unit, count) - 8usize];
};
pub type pmix_resource_unit_t = pmix_resource_unit;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_device_distance {
    pub uuid: *mut ::std::os::raw::c_char,
    pub osname: *mut ::std::os::raw::c_char,
    pub type_: pmix_device_type_t,
    pub mindist: u16,
    pub maxdist: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_device_distance"][::std::mem::size_of::<pmix_device_distance>() - 32usize];
    ["Alignment of pmix_device_distance"][::std::mem::align_of::<pmix_device_distance>() - 8usize];
    ["Offset of field: pmix_device_distance::uuid"]
        [::std::mem::offset_of!(pmix_device_distance, uuid) - 0usize];
    ["Offset of field: pmix_device_distance::osname"]
        [::std::mem::offset_of!(pmix_device_distance, osname) - 8usize];
    ["Offset of field: pmix_device_distance::type_"]
        [::std::mem::offset_of!(pmix_device_distance, type_) - 16usize];
    ["Offset of field: pmix_device_distance::mindist"]
        [::std::mem::offset_of!(pmix_device_distance, mindist) - 24usize];
    ["Offset of field: pmix_device_distance::maxdist"]
        [::std::mem::offset_of!(pmix_device_distance, maxdist) - 26usize];
};
pub type pmix_device_distance_t = pmix_device_distance;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_node_pid {
    pub hostname: *mut ::std::os::raw::c_char,
    pub nodeid: u32,
    pub pid: pid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_node_pid"][::std::mem::size_of::<pmix_node_pid>() - 16usize];
    ["Alignment of pmix_node_pid"][::std::mem::align_of::<pmix_node_pid>() - 8usize];
    ["Offset of field: pmix_node_pid::hostname"]
        [::std::mem::offset_of!(pmix_node_pid, hostname) - 0usize];
    ["Offset of field: pmix_node_pid::nodeid"]
        [::std::mem::offset_of!(pmix_node_pid, nodeid) - 8usize];
    ["Offset of field: pmix_node_pid::pid"][::std::mem::offset_of!(pmix_node_pid, pid) - 12usize];
};
pub type pmix_node_pid_t = pmix_node_pid;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_byte_object {
    pub bytes: *mut ::std::os::raw::c_char,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_byte_object"][::std::mem::size_of::<pmix_byte_object>() - 16usize];
    ["Alignment of pmix_byte_object"][::std::mem::align_of::<pmix_byte_object>() - 8usize];
    ["Offset of field: pmix_byte_object::bytes"]
        [::std::mem::offset_of!(pmix_byte_object, bytes) - 0usize];
    ["Offset of field: pmix_byte_object::size"]
        [::std::mem::offset_of!(pmix_byte_object, size) - 8usize];
};
pub type pmix_byte_object_t = pmix_byte_object;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_endpoint {
    pub uuid: *mut ::std::os::raw::c_char,
    pub osname: *mut ::std::os::raw::c_char,
    pub endpt: pmix_byte_object_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_endpoint"][::std::mem::size_of::<pmix_endpoint>() - 32usize];
    ["Alignment of pmix_endpoint"][::std::mem::align_of::<pmix_endpoint>() - 8usize];
    ["Offset of field: pmix_endpoint::uuid"][::std::mem::offset_of!(pmix_endpoint, uuid) - 0usize];
    ["Offset of field: pmix_endpoint::osname"]
        [::std::mem::offset_of!(pmix_endpoint, osname) - 8usize];
    ["Offset of field: pmix_endpoint::endpt"]
        [::std::mem::offset_of!(pmix_endpoint, endpt) - 16usize];
};
pub type pmix_endpoint_t = pmix_endpoint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_envar_t {
    pub envar: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_char,
    pub separator: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_envar_t"][::std::mem::size_of::<pmix_envar_t>() - 24usize];
    ["Alignment of pmix_envar_t"][::std::mem::align_of::<pmix_envar_t>() - 8usize];
    ["Offset of field: pmix_envar_t::envar"][::std::mem::offset_of!(pmix_envar_t, envar) - 0usize];
    ["Offset of field: pmix_envar_t::value"][::std::mem::offset_of!(pmix_envar_t, value) - 8usize];
    ["Offset of field: pmix_envar_t::separator"]
        [::std::mem::offset_of!(pmix_envar_t, separator) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_data_buffer {
    pub base_ptr: *mut ::std::os::raw::c_char,
    pub pack_ptr: *mut ::std::os::raw::c_char,
    pub unpack_ptr: *mut ::std::os::raw::c_char,
    pub bytes_allocated: usize,
    pub bytes_used: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_data_buffer"][::std::mem::size_of::<pmix_data_buffer>() - 40usize];
    ["Alignment of pmix_data_buffer"][::std::mem::align_of::<pmix_data_buffer>() - 8usize];
    ["Offset of field: pmix_data_buffer::base_ptr"]
        [::std::mem::offset_of!(pmix_data_buffer, base_ptr) - 0usize];
    ["Offset of field: pmix_data_buffer::pack_ptr"]
        [::std::mem::offset_of!(pmix_data_buffer, pack_ptr) - 8usize];
    ["Offset of field: pmix_data_buffer::unpack_ptr"]
        [::std::mem::offset_of!(pmix_data_buffer, unpack_ptr) - 16usize];
    ["Offset of field: pmix_data_buffer::bytes_allocated"]
        [::std::mem::offset_of!(pmix_data_buffer, bytes_allocated) - 24usize];
    ["Offset of field: pmix_data_buffer::bytes_used"]
        [::std::mem::offset_of!(pmix_data_buffer, bytes_used) - 32usize];
};
pub type pmix_data_buffer_t = pmix_data_buffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_proc {
    pub nspace: pmix_nspace_t,
    pub rank: pmix_rank_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_proc"][::std::mem::size_of::<pmix_proc>() - 260usize];
    ["Alignment of pmix_proc"][::std::mem::align_of::<pmix_proc>() - 4usize];
    ["Offset of field: pmix_proc::nspace"][::std::mem::offset_of!(pmix_proc, nspace) - 0usize];
    ["Offset of field: pmix_proc::rank"][::std::mem::offset_of!(pmix_proc, rank) - 256usize];
};
pub type pmix_proc_t = pmix_proc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_proc_info {
    pub proc_: pmix_proc_t,
    pub hostname: *mut ::std::os::raw::c_char,
    pub executable_name: *mut ::std::os::raw::c_char,
    pub pid: pid_t,
    pub exit_code: ::std::os::raw::c_int,
    pub state: pmix_proc_state_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_proc_info"][::std::mem::size_of::<pmix_proc_info>() - 296usize];
    ["Alignment of pmix_proc_info"][::std::mem::align_of::<pmix_proc_info>() - 8usize];
    ["Offset of field: pmix_proc_info::proc_"]
        [::std::mem::offset_of!(pmix_proc_info, proc_) - 0usize];
    ["Offset of field: pmix_proc_info::hostname"]
        [::std::mem::offset_of!(pmix_proc_info, hostname) - 264usize];
    ["Offset of field: pmix_proc_info::executable_name"]
        [::std::mem::offset_of!(pmix_proc_info, executable_name) - 272usize];
    ["Offset of field: pmix_proc_info::pid"]
        [::std::mem::offset_of!(pmix_proc_info, pid) - 280usize];
    ["Offset of field: pmix_proc_info::exit_code"]
        [::std::mem::offset_of!(pmix_proc_info, exit_code) - 284usize];
    ["Offset of field: pmix_proc_info::state"]
        [::std::mem::offset_of!(pmix_proc_info, state) - 288usize];
};
pub type pmix_proc_info_t = pmix_proc_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_data_array {
    pub type_: pmix_data_type_t,
    pub size: usize,
    pub array: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_data_array"][::std::mem::size_of::<pmix_data_array>() - 24usize];
    ["Alignment of pmix_data_array"][::std::mem::align_of::<pmix_data_array>() - 8usize];
    ["Offset of field: pmix_data_array::type_"]
        [::std::mem::offset_of!(pmix_data_array, type_) - 0usize];
    ["Offset of field: pmix_data_array::size"]
        [::std::mem::offset_of!(pmix_data_array, size) - 8usize];
    ["Offset of field: pmix_data_array::array"]
        [::std::mem::offset_of!(pmix_data_array, array) - 16usize];
};
pub type pmix_data_array_t = pmix_data_array;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pmix_value {
    pub type_: pmix_data_type_t,
    pub data: pmix_value__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pmix_value__bindgen_ty_1 {
    pub flag: bool,
    pub byte: u8,
    pub string: *mut ::std::os::raw::c_char,
    pub size: usize,
    pub pid: pid_t,
    pub integer: ::std::os::raw::c_int,
    pub int8: i8,
    pub int16: i16,
    pub int32: i32,
    pub int64: i64,
    pub uint: ::std::os::raw::c_uint,
    pub uint8: u8,
    pub uint16: u16,
    pub uint32: u32,
    pub uint64: u64,
    pub fval: f32,
    pub dval: f64,
    pub tv: timeval,
    pub time: time_t,
    pub status: pmix_status_t,
    pub rank: pmix_rank_t,
    pub nspace: *mut pmix_nspace_t,
    pub proc_: *mut pmix_proc_t,
    pub bo: pmix_byte_object_t,
    pub persist: pmix_persistence_t,
    pub scope: pmix_scope_t,
    pub range: pmix_data_range_t,
    pub state: pmix_proc_state_t,
    pub pinfo: *mut pmix_proc_info_t,
    pub darray: *mut pmix_data_array_t,
    pub ptr: *mut ::std::os::raw::c_void,
    pub adir: pmix_alloc_directive_t,
    pub rbdir: pmix_resource_block_directive_t,
    pub envar: pmix_envar_t,
    pub coord: *mut pmix_coord_t,
    pub linkstate: pmix_link_state_t,
    pub jstate: pmix_job_state_t,
    pub topo: *mut pmix_topology_t,
    pub cpuset: *mut pmix_cpuset_t,
    pub locality: pmix_locality_t,
    pub geometry: *mut pmix_geometry_t,
    pub devtype: pmix_device_type_t,
    pub device: *mut pmix_device_t,
    pub devdist: *mut pmix_device_distance_t,
    pub endpoint: *mut pmix_endpoint_t,
    pub dbuf: *mut pmix_data_buffer_t,
    pub resunit: *mut pmix_resource_unit_t,
    pub nodepid: *mut pmix_node_pid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_value__bindgen_ty_1"]
        [::std::mem::size_of::<pmix_value__bindgen_ty_1>() - 24usize];
    ["Alignment of pmix_value__bindgen_ty_1"]
        [::std::mem::align_of::<pmix_value__bindgen_ty_1>() - 8usize];
    ["Offset of field: pmix_value__bindgen_ty_1::flag"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, flag) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::byte"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, byte) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::string"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, string) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::size"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, size) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::pid"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, pid) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::integer"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, integer) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::int8"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, int8) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::int16"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, int16) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::int32"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, int32) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::int64"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, int64) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::uint"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, uint) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::uint8"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, uint8) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::uint16"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, uint16) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::uint32"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, uint32) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::uint64"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, uint64) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::fval"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, fval) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::dval"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, dval) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::tv"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, tv) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::time"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, time) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::status"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, status) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::rank"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, rank) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::nspace"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, nspace) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::proc_"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, proc_) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::bo"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, bo) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::persist"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, persist) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::scope"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, scope) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::range"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, range) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::state"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, state) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::pinfo"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, pinfo) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::darray"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, darray) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::ptr"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, ptr) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::adir"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, adir) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::rbdir"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, rbdir) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::envar"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, envar) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::coord"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, coord) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::linkstate"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, linkstate) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::jstate"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, jstate) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::topo"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, topo) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::cpuset"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, cpuset) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::locality"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, locality) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::geometry"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, geometry) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::devtype"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, devtype) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::device"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, device) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::devdist"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, devdist) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::endpoint"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, endpoint) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::dbuf"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, dbuf) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::resunit"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, resunit) - 0usize];
    ["Offset of field: pmix_value__bindgen_ty_1::nodepid"]
        [::std::mem::offset_of!(pmix_value__bindgen_ty_1, nodepid) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_value"][::std::mem::size_of::<pmix_value>() - 32usize];
    ["Alignment of pmix_value"][::std::mem::align_of::<pmix_value>() - 8usize];
    ["Offset of field: pmix_value::type_"][::std::mem::offset_of!(pmix_value, type_) - 0usize];
    ["Offset of field: pmix_value::data"][::std::mem::offset_of!(pmix_value, data) - 8usize];
};
pub type pmix_value_t = pmix_value;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pmix_info {
    pub key: pmix_key_t,
    pub flags: pmix_info_directives_t,
    pub value: pmix_value_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_info"][::std::mem::size_of::<pmix_info>() - 552usize];
    ["Alignment of pmix_info"][::std::mem::align_of::<pmix_info>() - 8usize];
    ["Offset of field: pmix_info::key"][::std::mem::offset_of!(pmix_info, key) - 0usize];
    ["Offset of field: pmix_info::flags"][::std::mem::offset_of!(pmix_info, flags) - 512usize];
    ["Offset of field: pmix_info::value"][::std::mem::offset_of!(pmix_info, value) - 520usize];
};
pub type pmix_info_t = pmix_info;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum pmix_boolean_t {
    PMIX_BOOL_TRUE = 0,
    PMIX_BOOL_FALSE = 1,
    PMIX_NON_BOOL = 2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pmix_pdata {
    pub proc_: pmix_proc_t,
    pub key: pmix_key_t,
    pub value: pmix_value_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_pdata"][::std::mem::size_of::<pmix_pdata>() - 808usize];
    ["Alignment of pmix_pdata"][::std::mem::align_of::<pmix_pdata>() - 8usize];
    ["Offset of field: pmix_pdata::proc_"][::std::mem::offset_of!(pmix_pdata, proc_) - 0usize];
    ["Offset of field: pmix_pdata::key"][::std::mem::offset_of!(pmix_pdata, key) - 260usize];
    ["Offset of field: pmix_pdata::value"][::std::mem::offset_of!(pmix_pdata, value) - 776usize];
};
pub type pmix_pdata_t = pmix_pdata;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_app {
    pub cmd: *mut ::std::os::raw::c_char,
    pub argv: *mut *mut ::std::os::raw::c_char,
    pub env: *mut *mut ::std::os::raw::c_char,
    pub cwd: *mut ::std::os::raw::c_char,
    pub maxprocs: ::std::os::raw::c_int,
    pub info: *mut pmix_info_t,
    pub ninfo: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_app"][::std::mem::size_of::<pmix_app>() - 56usize];
    ["Alignment of pmix_app"][::std::mem::align_of::<pmix_app>() - 8usize];
    ["Offset of field: pmix_app::cmd"][::std::mem::offset_of!(pmix_app, cmd) - 0usize];
    ["Offset of field: pmix_app::argv"][::std::mem::offset_of!(pmix_app, argv) - 8usize];
    ["Offset of field: pmix_app::env"][::std::mem::offset_of!(pmix_app, env) - 16usize];
    ["Offset of field: pmix_app::cwd"][::std::mem::offset_of!(pmix_app, cwd) - 24usize];
    ["Offset of field: pmix_app::maxprocs"][::std::mem::offset_of!(pmix_app, maxprocs) - 32usize];
    ["Offset of field: pmix_app::info"][::std::mem::offset_of!(pmix_app, info) - 40usize];
    ["Offset of field: pmix_app::ninfo"][::std::mem::offset_of!(pmix_app, ninfo) - 48usize];
};
pub type pmix_app_t = pmix_app;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_query {
    pub keys: *mut *mut ::std::os::raw::c_char,
    pub qualifiers: *mut pmix_info_t,
    pub nqual: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_query"][::std::mem::size_of::<pmix_query>() - 24usize];
    ["Alignment of pmix_query"][::std::mem::align_of::<pmix_query>() - 8usize];
    ["Offset of field: pmix_query::keys"][::std::mem::offset_of!(pmix_query, keys) - 0usize];
    ["Offset of field: pmix_query::qualifiers"]
        [::std::mem::offset_of!(pmix_query, qualifiers) - 8usize];
    ["Offset of field: pmix_query::nqual"][::std::mem::offset_of!(pmix_query, nqual) - 16usize];
};
pub type pmix_query_t = pmix_query;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_regattr_t {
    pub name: *mut ::std::os::raw::c_char,
    pub string: pmix_key_t,
    pub type_: pmix_data_type_t,
    pub description: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_regattr_t"][::std::mem::size_of::<pmix_regattr_t>() - 536usize];
    ["Alignment of pmix_regattr_t"][::std::mem::align_of::<pmix_regattr_t>() - 8usize];
    ["Offset of field: pmix_regattr_t::name"]
        [::std::mem::offset_of!(pmix_regattr_t, name) - 0usize];
    ["Offset of field: pmix_regattr_t::string"]
        [::std::mem::offset_of!(pmix_regattr_t, string) - 8usize];
    ["Offset of field: pmix_regattr_t::type_"]
        [::std::mem::offset_of!(pmix_regattr_t, type_) - 520usize];
    ["Offset of field: pmix_regattr_t::description"]
        [::std::mem::offset_of!(pmix_regattr_t, description) - 528usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_fabric_s {
    pub name: *mut ::std::os::raw::c_char,
    pub index: usize,
    pub info: *mut pmix_info_t,
    pub ninfo: usize,
    pub module: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_fabric_s"][::std::mem::size_of::<pmix_fabric_s>() - 40usize];
    ["Alignment of pmix_fabric_s"][::std::mem::align_of::<pmix_fabric_s>() - 8usize];
    ["Offset of field: pmix_fabric_s::name"][::std::mem::offset_of!(pmix_fabric_s, name) - 0usize];
    ["Offset of field: pmix_fabric_s::index"]
        [::std::mem::offset_of!(pmix_fabric_s, index) - 8usize];
    ["Offset of field: pmix_fabric_s::info"][::std::mem::offset_of!(pmix_fabric_s, info) - 16usize];
    ["Offset of field: pmix_fabric_s::ninfo"]
        [::std::mem::offset_of!(pmix_fabric_s, ninfo) - 24usize];
    ["Offset of field: pmix_fabric_s::module"]
        [::std::mem::offset_of!(pmix_fabric_s, module) - 32usize];
};
pub type pmix_fabric_t = pmix_fabric_s;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum pmix_fabric_operation_t {
    PMIX_FABRIC_REQUEST_INFO = 0,
    PMIX_FABRIC_UPDATE_INFO = 1,
}
pub type pmix_release_cbfunc_t =
    ::std::option::Option<unsafe extern "C" fn(cbdata: *mut ::std::os::raw::c_void)>;
pub type pmix_modex_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        data: *const ::std::os::raw::c_char,
        ndata: usize,
        cbdata: *mut ::std::os::raw::c_void,
        release_fn: pmix_release_cbfunc_t,
        release_cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_spawn_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        nspace: *mut ::std::os::raw::c_char,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_op_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(status: pmix_status_t, cbdata: *mut ::std::os::raw::c_void),
>;
pub type pmix_lookup_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        data: *mut pmix_pdata_t,
        ndata: usize,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_event_notification_cbfunc_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        results: *mut pmix_info_t,
        nresults: usize,
        cbfunc: pmix_op_cbfunc_t,
        thiscbdata: *mut ::std::os::raw::c_void,
        notification_cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_notification_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        evhdlr_registration_id: usize,
        status: pmix_status_t,
        source: *const pmix_proc_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        results: *mut pmix_info_t,
        nresults: usize,
        cbfunc: pmix_event_notification_cbfunc_fn_t,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_hdlr_reg_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(status: pmix_status_t, refid: usize, cbdata: *mut ::std::os::raw::c_void),
>;
pub type pmix_evhdlr_reg_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(status: pmix_status_t, refid: usize, cbdata: *mut ::std::os::raw::c_void),
>;
pub type pmix_value_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        kv: *mut pmix_value_t,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_info_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbdata: *mut ::std::os::raw::c_void,
        release_fn: pmix_release_cbfunc_t,
        release_cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_credential_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        credential: *mut pmix_byte_object_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_validation_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_device_dist_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        dist: *mut pmix_device_distance_t,
        ndist: usize,
        cbdata: *mut ::std::os::raw::c_void,
        release_fn: pmix_release_cbfunc_t,
        release_cbdata: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
    pub fn PMIx_tool_connect_to_server(
        proc_: *mut pmix_proc_t,
        info: *mut pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Load_key(key: *mut ::std::os::raw::c_char, src: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn PMIx_Check_key(
        key: *const ::std::os::raw::c_char,
        str_: *const ::std::os::raw::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Check_reserved_key(key: *const ::std::os::raw::c_char) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Load_nspace(
        nspace: *mut ::std::os::raw::c_char,
        str_: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn PMIx_Check_nspace(
        key1: *const ::std::os::raw::c_char,
        key2: *const ::std::os::raw::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Nspace_invalid(nspace: *const ::std::os::raw::c_char) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Load_procid(
        p: *mut pmix_proc_t,
        ns: *const ::std::os::raw::c_char,
        rk: pmix_rank_t,
    );
}
unsafe extern "C" {
    pub fn PMIx_Xfer_procid(dst: *mut pmix_proc_t, src: *const pmix_proc_t);
}
unsafe extern "C" {
    pub fn PMIx_Check_procid(a: *const pmix_proc_t, b: *const pmix_proc_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Check_rank(a: pmix_rank_t, b: pmix_rank_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Rank_valid(a: pmix_rank_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Procid_invalid(p: *const pmix_proc_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Argv_count(a: *mut *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn PMIx_Argv_append_nosize(
        argv: *mut *mut *mut ::std::os::raw::c_char,
        arg: *const ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Argv_prepend_nosize(
        argv: *mut *mut *mut ::std::os::raw::c_char,
        arg: *const ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Argv_append_unique_nosize(
        argv: *mut *mut *mut ::std::os::raw::c_char,
        arg: *const ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Argv_free(argv: *mut *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn PMIx_Argv_split(
        src_string: *const ::std::os::raw::c_char,
        delimiter: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Argv_split_with_empty(
        src_string: *const ::std::os::raw::c_char,
        delimiter: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Argv_split_inter(
        src_string: *const ::std::os::raw::c_char,
        delimiter: ::std::os::raw::c_int,
        include_empty: bool,
    ) -> *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Argv_join(
        argv: *mut *mut ::std::os::raw::c_char,
        delimiter: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Argv_copy(
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Setenv(
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        overwrite: bool,
        env: *mut *mut *mut ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Value_construct(val: *mut pmix_value_t);
}
unsafe extern "C" {
    pub fn PMIx_Value_destruct(val: *mut pmix_value_t);
}
unsafe extern "C" {
    pub fn PMIx_Value_create(n: usize) -> *mut pmix_value_t;
}
unsafe extern "C" {
    pub fn PMIx_Value_free(v: *mut pmix_value_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Value_true(v: *const pmix_value_t) -> pmix_boolean_t;
}
unsafe extern "C" {
    pub fn PMIx_Value_load(
        val: *mut pmix_value_t,
        data: *const ::std::os::raw::c_void,
        type_: pmix_data_type_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Value_unload(
        val: *mut pmix_value_t,
        data: *mut *mut ::std::os::raw::c_void,
        sz: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Value_xfer(dest: *mut pmix_value_t, src: *const pmix_value_t) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Value_compare(v1: *mut pmix_value_t, v2: *mut pmix_value_t) -> pmix_value_cmp_t;
}
unsafe extern "C" {
    pub fn PMIx_Value_get_number(
        value: *const pmix_value_t,
        dest: *mut ::std::os::raw::c_void,
        type_: pmix_data_type_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_array_init(p: *mut pmix_data_array_t, type_: pmix_data_type_t);
}
unsafe extern "C" {
    pub fn PMIx_Data_array_construct(
        p: *mut pmix_data_array_t,
        num: usize,
        type_: pmix_data_type_t,
    );
}
unsafe extern "C" {
    pub fn PMIx_Data_array_destruct(d: *mut pmix_data_array_t);
}
unsafe extern "C" {
    pub fn PMIx_Data_array_create(n: usize, type_: pmix_data_type_t) -> *mut pmix_data_array_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_array_free(p: *mut pmix_data_array_t);
}
unsafe extern "C" {
    pub fn PMIx_Info_construct(p: *mut pmix_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Info_destruct(p: *mut pmix_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Info_create(n: usize) -> *mut pmix_info_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_free(p: *mut pmix_info_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Info_true(p: *const pmix_info_t) -> pmix_boolean_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_load(
        info: *mut pmix_info_t,
        key: *const ::std::os::raw::c_char,
        data: *const ::std::os::raw::c_void,
        type_: pmix_data_type_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_xfer(dest: *mut pmix_info_t, src: *const pmix_info_t) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_required(p: *mut pmix_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Info_optional(p: *mut pmix_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Info_is_required(p: *const pmix_info_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Info_is_optional(p: *const pmix_info_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Info_processed(p: *mut pmix_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Info_was_processed(p: *const pmix_info_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Info_set_end(p: *mut pmix_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Info_is_end(p: *const pmix_info_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Info_qualifier(p: *mut pmix_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Info_is_qualifier(p: *const pmix_info_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Info_persistent(p: *mut pmix_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Info_is_persistent(p: *const pmix_info_t) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_start() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_add(
        ptr: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_void,
        type_: pmix_data_type_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_add_unique(
        ptr: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_void,
        type_: pmix_data_type_t,
        overwrite: bool,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_add_value(
        ptr: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_char,
        value: *const pmix_value_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_add_value_unique(
        ptr: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_char,
        value: *const pmix_value_t,
        overwrite: bool,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_prepend(
        ptr: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_void,
        type_: pmix_data_type_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_insert(
        ptr: *mut ::std::os::raw::c_void,
        info: *mut pmix_info_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_xfer(
        ptr: *mut ::std::os::raw::c_void,
        info: *const pmix_info_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_xfer_unique(
        ptr: *mut ::std::os::raw::c_void,
        info: *const pmix_info_t,
        overwrite: bool,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_convert(
        ptr: *mut ::std::os::raw::c_void,
        par: *mut pmix_data_array_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_release(ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn PMIx_Info_list_get_info(
        ptr: *mut ::std::os::raw::c_void,
        prev: *mut ::std::os::raw::c_void,
        next: *mut *mut ::std::os::raw::c_void,
    ) -> *mut pmix_info_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_list_get_size(ptr: *mut ::std::os::raw::c_void) -> usize;
}
unsafe extern "C" {
    pub fn PMIx_Coord_construct(m: *mut pmix_coord_t);
}
unsafe extern "C" {
    pub fn PMIx_Coord_destruct(m: *mut pmix_coord_t);
}
unsafe extern "C" {
    pub fn PMIx_Coord_create(dims: usize, number: usize) -> *mut pmix_coord_t;
}
unsafe extern "C" {
    pub fn PMIx_Coord_free(m: *mut pmix_coord_t, number: usize);
}
unsafe extern "C" {
    pub fn PMIx_Topology_construct(t: *mut pmix_topology_t);
}
unsafe extern "C" {
    pub fn PMIx_Topology_destruct(topo: *mut pmix_topology_t);
}
unsafe extern "C" {
    pub fn PMIx_Topology_create(n: usize) -> *mut pmix_topology_t;
}
unsafe extern "C" {
    pub fn PMIx_Topology_free(t: *mut pmix_topology_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Cpuset_construct(cpuset: *mut pmix_cpuset_t);
}
unsafe extern "C" {
    pub fn PMIx_Cpuset_destruct(cpuset: *mut pmix_cpuset_t);
}
unsafe extern "C" {
    pub fn PMIx_Cpuset_create(n: usize) -> *mut pmix_cpuset_t;
}
unsafe extern "C" {
    pub fn PMIx_Cpuset_free(c: *mut pmix_cpuset_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Geometry_construct(g: *mut pmix_geometry_t);
}
unsafe extern "C" {
    pub fn PMIx_Geometry_destruct(g: *mut pmix_geometry_t);
}
unsafe extern "C" {
    pub fn PMIx_Geometry_create(n: usize) -> *mut pmix_geometry_t;
}
unsafe extern "C" {
    pub fn PMIx_Geometry_free(g: *mut pmix_geometry_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Device_construct(d: *mut pmix_device_t);
}
unsafe extern "C" {
    pub fn PMIx_Device_destruct(d: *mut pmix_device_t);
}
unsafe extern "C" {
    pub fn PMIx_Device_create(n: usize) -> *mut pmix_device_t;
}
unsafe extern "C" {
    pub fn PMIx_Device_free(d: *mut pmix_device_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Node_pid_construct(d: *mut pmix_node_pid_t);
}
unsafe extern "C" {
    pub fn PMIx_Node_pid_destruct(d: *mut pmix_node_pid_t);
}
unsafe extern "C" {
    pub fn PMIx_Node_pid_create(n: usize) -> *mut pmix_node_pid_t;
}
unsafe extern "C" {
    pub fn PMIx_Node_pid_free(d: *mut pmix_node_pid_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Resource_unit_construct(d: *mut pmix_resource_unit_t);
}
unsafe extern "C" {
    pub fn PMIx_Resource_unit_destruct(d: *mut pmix_resource_unit_t);
}
unsafe extern "C" {
    pub fn PMIx_Resource_unit_create(n: usize) -> *mut pmix_resource_unit_t;
}
unsafe extern "C" {
    pub fn PMIx_Resource_unit_free(d: *mut pmix_resource_unit_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Device_distance_construct(d: *mut pmix_device_distance_t);
}
unsafe extern "C" {
    pub fn PMIx_Device_distance_destruct(d: *mut pmix_device_distance_t);
}
unsafe extern "C" {
    pub fn PMIx_Device_distance_create(n: usize) -> *mut pmix_device_distance_t;
}
unsafe extern "C" {
    pub fn PMIx_Device_distance_free(d: *mut pmix_device_distance_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Byte_object_construct(b: *mut pmix_byte_object_t);
}
unsafe extern "C" {
    pub fn PMIx_Byte_object_destruct(g: *mut pmix_byte_object_t);
}
unsafe extern "C" {
    pub fn PMIx_Byte_object_create(n: usize) -> *mut pmix_byte_object_t;
}
unsafe extern "C" {
    pub fn PMIx_Byte_object_free(g: *mut pmix_byte_object_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Byte_object_load(
        b: *mut pmix_byte_object_t,
        d: *mut ::std::os::raw::c_char,
        sz: usize,
    );
}
unsafe extern "C" {
    pub fn PMIx_Endpoint_construct(e: *mut pmix_endpoint_t);
}
unsafe extern "C" {
    pub fn PMIx_Endpoint_destruct(e: *mut pmix_endpoint_t);
}
unsafe extern "C" {
    pub fn PMIx_Endpoint_create(n: usize) -> *mut pmix_endpoint_t;
}
unsafe extern "C" {
    pub fn PMIx_Endpoint_free(e: *mut pmix_endpoint_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Envar_construct(e: *mut pmix_envar_t);
}
unsafe extern "C" {
    pub fn PMIx_Envar_destruct(e: *mut pmix_envar_t);
}
unsafe extern "C" {
    pub fn PMIx_Envar_create(n: usize) -> *mut pmix_envar_t;
}
unsafe extern "C" {
    pub fn PMIx_Envar_free(e: *mut pmix_envar_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Envar_load(
        e: *mut pmix_envar_t,
        var: *mut ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_char,
        separator: ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn PMIx_Data_buffer_construct(b: *mut pmix_data_buffer_t);
}
unsafe extern "C" {
    pub fn PMIx_Data_buffer_destruct(b: *mut pmix_data_buffer_t);
}
unsafe extern "C" {
    pub fn PMIx_Data_buffer_create() -> *mut pmix_data_buffer_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_buffer_release(b: *mut pmix_data_buffer_t);
}
unsafe extern "C" {
    pub fn PMIx_Data_buffer_load(
        b: *mut pmix_data_buffer_t,
        bytes: *mut ::std::os::raw::c_char,
        sz: usize,
    );
}
unsafe extern "C" {
    pub fn PMIx_Data_buffer_unload(
        b: *mut pmix_data_buffer_t,
        bytes: *mut *mut ::std::os::raw::c_char,
        sz: *mut usize,
    );
}
unsafe extern "C" {
    pub fn PMIx_Proc_construct(p: *mut pmix_proc_t);
}
unsafe extern "C" {
    pub fn PMIx_Proc_destruct(p: *mut pmix_proc_t);
}
unsafe extern "C" {
    pub fn PMIx_Proc_create(n: usize) -> *mut pmix_proc_t;
}
unsafe extern "C" {
    pub fn PMIx_Proc_free(p: *mut pmix_proc_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Proc_load(
        p: *mut pmix_proc_t,
        nspace: *const ::std::os::raw::c_char,
        rank: pmix_rank_t,
    );
}
unsafe extern "C" {
    pub fn PMIx_Multicluster_nspace_construct(
        target: *mut ::std::os::raw::c_char,
        cluster: *mut ::std::os::raw::c_char,
        nspace: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn PMIx_Multicluster_nspace_parse(
        target: *mut ::std::os::raw::c_char,
        cluster: *mut ::std::os::raw::c_char,
        nspace: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn PMIx_Proc_info_construct(p: *mut pmix_proc_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Proc_info_destruct(p: *mut pmix_proc_info_t);
}
unsafe extern "C" {
    pub fn PMIx_Proc_info_create(n: usize) -> *mut pmix_proc_info_t;
}
unsafe extern "C" {
    pub fn PMIx_Proc_info_free(p: *mut pmix_proc_info_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Pdata_construct(p: *mut pmix_pdata_t);
}
unsafe extern "C" {
    pub fn PMIx_Pdata_destruct(p: *mut pmix_pdata_t);
}
unsafe extern "C" {
    pub fn PMIx_Pdata_create(n: usize) -> *mut pmix_pdata_t;
}
unsafe extern "C" {
    pub fn PMIx_Pdata_free(p: *mut pmix_pdata_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Pdata_load(
        dest: *mut pmix_pdata_t,
        p: *const pmix_proc_t,
        key: *const ::std::os::raw::c_char,
        data: *const ::std::os::raw::c_void,
        type_: pmix_data_type_t,
    );
}
unsafe extern "C" {
    pub fn PMIx_Pdata_xfer(dest: *mut pmix_pdata_t, src: *mut pmix_pdata_t);
}
unsafe extern "C" {
    pub fn PMIx_App_construct(p: *mut pmix_app_t);
}
unsafe extern "C" {
    pub fn PMIx_App_destruct(p: *mut pmix_app_t);
}
unsafe extern "C" {
    pub fn PMIx_App_create(n: usize) -> *mut pmix_app_t;
}
unsafe extern "C" {
    pub fn PMIx_App_info_create(p: *mut pmix_app_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_App_free(p: *mut pmix_app_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_App_release(p: *mut pmix_app_t);
}
unsafe extern "C" {
    pub fn PMIx_Query_construct(p: *mut pmix_query_t);
}
unsafe extern "C" {
    pub fn PMIx_Query_destruct(p: *mut pmix_query_t);
}
unsafe extern "C" {
    pub fn PMIx_Query_create(n: usize) -> *mut pmix_query_t;
}
unsafe extern "C" {
    pub fn PMIx_Query_qualifiers_create(p: *mut pmix_query_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Query_free(p: *mut pmix_query_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Query_release(p: *mut pmix_query_t);
}
unsafe extern "C" {
    pub fn PMIx_Regattr_construct(p: *mut pmix_regattr_t);
}
unsafe extern "C" {
    pub fn PMIx_Regattr_destruct(p: *mut pmix_regattr_t);
}
unsafe extern "C" {
    pub fn PMIx_Regattr_create(n: usize) -> *mut pmix_regattr_t;
}
unsafe extern "C" {
    pub fn PMIx_Regattr_free(p: *mut pmix_regattr_t, n: usize);
}
unsafe extern "C" {
    pub fn PMIx_Regattr_load(
        info: *mut pmix_regattr_t,
        name: *const ::std::os::raw::c_char,
        key: *const ::std::os::raw::c_char,
        type_: pmix_data_type_t,
        description: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn PMIx_Regattr_xfer(dest: *mut pmix_regattr_t, src: *const pmix_regattr_t);
}
unsafe extern "C" {
    pub fn PMIx_Fabric_construct(p: *mut pmix_fabric_t);
}
unsafe extern "C" {
    pub fn PMIx_Init(
        proc_: *mut pmix_proc_t,
        info: *mut pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Finalize(info: *const pmix_info_t, ninfo: usize) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Initialized() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn PMIx_Abort(
        status: ::std::os::raw::c_int,
        msg: *const ::std::os::raw::c_char,
        procs: *mut pmix_proc_t,
        nprocs: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Put(
        scope: pmix_scope_t,
        key: *const ::std::os::raw::c_char,
        val: *mut pmix_value_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Commit() -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Fence(
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Fence_nb(
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Get(
        proc_: *const pmix_proc_t,
        key: *const ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
        val: *mut *mut pmix_value_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Get_nb(
        proc_: *const pmix_proc_t,
        key: *const ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_value_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Publish(info: *const pmix_info_t, ninfo: usize) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Publish_nb(
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Lookup(
        data: *mut pmix_pdata_t,
        ndata: usize,
        info: *const pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Lookup_nb(
        keys: *mut *mut ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_lookup_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Unpublish(
        keys: *mut *mut ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Unpublish_nb(
        keys: *mut *mut ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Spawn(
        job_info: *const pmix_info_t,
        ninfo: usize,
        apps: *const pmix_app_t,
        napps: usize,
        nspace: *mut ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Spawn_nb(
        job_info: *const pmix_info_t,
        ninfo: usize,
        apps: *const pmix_app_t,
        napps: usize,
        cbfunc: pmix_spawn_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Connect(
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Connect_nb(
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Disconnect(
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Disconnect_nb(
        ranges: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Resolve_peers(
        nodename: *const ::std::os::raw::c_char,
        nspace: *const ::std::os::raw::c_char,
        procs: *mut *mut pmix_proc_t,
        nprocs: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Resolve_nodes(
        nspace: *const ::std::os::raw::c_char,
        nodelist: *mut *mut ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Query_info(
        queries: *mut pmix_query_t,
        nqueries: usize,
        results: *mut *mut pmix_info_t,
        nresults: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Query_info_nb(
        queries: *mut pmix_query_t,
        nqueries: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Log(
        data: *const pmix_info_t,
        ndata: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Log_nb(
        data: *const pmix_info_t,
        ndata: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Allocation_request(
        directive: pmix_alloc_directive_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        results: *mut *mut pmix_info_t,
        nresults: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Allocation_request_nb(
        directive: pmix_alloc_directive_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Resource_block(
        directive: pmix_resource_block_directive_t,
        block: *mut ::std::os::raw::c_char,
        res: *const pmix_resource_unit_t,
        nres: usize,
        info: *const pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Resource_block_nb(
        directive: pmix_resource_block_directive_t,
        block: *mut ::std::os::raw::c_char,
        res: *const pmix_resource_unit_t,
        nres: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Session_control(
        sessionID: u32,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Job_control(
        targets: *const pmix_proc_t,
        ntargets: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        results: *mut *mut pmix_info_t,
        nresults: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Job_control_nb(
        targets: *const pmix_proc_t,
        ntargets: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Process_monitor(
        monitor: *const pmix_info_t,
        error: pmix_status_t,
        directives: *const pmix_info_t,
        ndirs: usize,
        results: *mut *mut pmix_info_t,
        nresults: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Process_monitor_nb(
        monitor: *const pmix_info_t,
        error: pmix_status_t,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Heartbeat();
}
unsafe extern "C" {
    pub fn PMIx_Get_credential(
        info: *const pmix_info_t,
        ninfo: usize,
        credential: *mut pmix_byte_object_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Get_credential_nb(
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_credential_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Validate_credential(
        cred: *const pmix_byte_object_t,
        info: *const pmix_info_t,
        ninfo: usize,
        results: *mut *mut pmix_info_t,
        nresults: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Validate_credential_nb(
        cred: *const pmix_byte_object_t,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_validation_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_construct(
        grp: *const ::std::os::raw::c_char,
        procs: *const pmix_proc_t,
        nprocs: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        results: *mut *mut pmix_info_t,
        nresults: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_construct_nb(
        grp: *const ::std::os::raw::c_char,
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_invite(
        grp: *const ::std::os::raw::c_char,
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        results: *mut *mut pmix_info_t,
        nresult: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_invite_nb(
        grp: *const ::std::os::raw::c_char,
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_join(
        grp: *const ::std::os::raw::c_char,
        leader: *const pmix_proc_t,
        opt: pmix_group_opt_t,
        info: *const pmix_info_t,
        ninfo: usize,
        results: *mut *mut pmix_info_t,
        nresult: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_join_nb(
        grp: *const ::std::os::raw::c_char,
        leader: *const pmix_proc_t,
        opt: pmix_group_opt_t,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_leave(
        grp: *const ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_leave_nb(
        grp: *const ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_destruct(
        grp: *const ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Group_destruct_nb(
        grp: *const ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Register_event_handler(
        codes: *mut pmix_status_t,
        ncodes: usize,
        info: *mut pmix_info_t,
        ninfo: usize,
        evhdlr: pmix_notification_fn_t,
        cbfunc: pmix_hdlr_reg_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Deregister_event_handler(
        evhdlr_ref: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Notify_event(
        status: pmix_status_t,
        source: *const pmix_proc_t,
        range: pmix_data_range_t,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Fabric_register(
        fabric: *mut pmix_fabric_t,
        directives: *const pmix_info_t,
        ndirs: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Fabric_register_nb(
        fabric: *mut pmix_fabric_t,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Fabric_update(fabric: *mut pmix_fabric_t) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Fabric_update_nb(
        fabric: *mut pmix_fabric_t,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Fabric_deregister(fabric: *mut pmix_fabric_t) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Fabric_deregister_nb(
        fabric: *mut pmix_fabric_t,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Compute_distances(
        topo: *mut pmix_topology_t,
        cpuset: *mut pmix_cpuset_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        distances: *mut *mut pmix_device_distance_t,
        ndist: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Compute_distances_nb(
        topo: *mut pmix_topology_t,
        cpuset: *mut pmix_cpuset_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_device_dist_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Load_topology(topo: *mut pmix_topology_t) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Parse_cpuset_string(
        cpuset_string: *const ::std::os::raw::c_char,
        cpuset: *mut pmix_cpuset_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Get_cpuset(cpuset: *mut pmix_cpuset_t, ref_: pmix_bind_envelope_t)
    -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Get_relative_locality(
        locality1: *const ::std::os::raw::c_char,
        locality2: *const ::std::os::raw::c_char,
        locality: *mut pmix_locality_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Progress();
}
unsafe extern "C" {
    pub fn PMIx_Progress_thread_stop(info: *const pmix_info_t, ninfo: usize);
}
unsafe extern "C" {
    pub fn PMIx_Error_string(status: pmix_status_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Error_code(errname: *const ::std::os::raw::c_char) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Proc_state_string(state: pmix_proc_state_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Scope_string(scope: pmix_scope_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Persistence_string(persist: pmix_persistence_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Data_range_string(range: pmix_data_range_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Data_type_string(type_: pmix_data_type_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Alloc_directive_string(
        directive: pmix_alloc_directive_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Resource_block_directive_string(
        directive: pmix_resource_block_directive_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_IOF_channel_string(channel: pmix_iof_channel_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Job_state_string(state: pmix_job_state_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Get_attribute_string(
        attribute: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Get_attribute_name(
        attrstring: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Link_state_string(state: pmix_link_state_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Device_type_string(type_: pmix_device_type_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Value_comparison_string(cmp: pmix_value_cmp_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Group_operation_string(op: pmix_group_operation_t)
    -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Info_string(info: *const pmix_info_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Value_string(value: *const pmix_value_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Info_directives_string(
        directives: pmix_info_directives_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_App_string(app: *const pmix_app_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Proc_string(proc_: *const pmix_proc_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Resource_unit_string(
        unit: *const pmix_resource_unit_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Get_version() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn PMIx_Store_internal(
        proc_: *const pmix_proc_t,
        key: *const ::std::os::raw::c_char,
        val: *mut pmix_value_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Value_get_size(val: *const pmix_value_t, size: *mut usize) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Info_get_size(val: *const pmix_info_t, size: *mut usize) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_pack(
        target: *const pmix_proc_t,
        buffer: *mut pmix_data_buffer_t,
        src: *mut ::std::os::raw::c_void,
        num_vals: i32,
        type_: pmix_data_type_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_unpack(
        source: *const pmix_proc_t,
        buffer: *mut pmix_data_buffer_t,
        dest: *mut ::std::os::raw::c_void,
        max_num_values: *mut i32,
        type_: pmix_data_type_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_copy(
        dest: *mut *mut ::std::os::raw::c_void,
        src: *mut ::std::os::raw::c_void,
        type_: pmix_data_type_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_print(
        output: *mut *mut ::std::os::raw::c_char,
        prefix: *mut ::std::os::raw::c_char,
        src: *mut ::std::os::raw::c_void,
        type_: pmix_data_type_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_copy_payload(
        dest: *mut pmix_data_buffer_t,
        src: *mut pmix_data_buffer_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_unload(
        buffer: *mut pmix_data_buffer_t,
        payload: *mut pmix_byte_object_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_load(
        buffer: *mut pmix_data_buffer_t,
        payload: *mut pmix_byte_object_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_embed(
        buffer: *mut pmix_data_buffer_t,
        payload: *const pmix_byte_object_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Data_compress(
        inbytes: *const u8,
        size: usize,
        outbytes: *mut *mut u8,
        nbytes: *mut usize,
    ) -> bool;
}
unsafe extern "C" {
    pub fn PMIx_Data_decompress(
        inbytes: *const u8,
        size: usize,
        outbytes: *mut *mut u8,
        nbytes: *mut usize,
    ) -> bool;
}
pub type pmix_server_client_connected_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        server_object: *mut ::std::os::raw::c_void,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_client_connected2_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        server_object: *mut ::std::os::raw::c_void,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_client_finalized_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        server_object: *mut ::std::os::raw::c_void,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_abort_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        server_object: *mut ::std::os::raw::c_void,
        status: ::std::os::raw::c_int,
        msg: *const ::std::os::raw::c_char,
        procs: *mut pmix_proc_t,
        nprocs: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_fencenb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        data: *mut ::std::os::raw::c_char,
        ndata: usize,
        cbfunc: pmix_modex_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_dmodex_req_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_modex_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_publish_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_lookup_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        keys: *mut *mut ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_lookup_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_unpublish_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        keys: *mut *mut ::std::os::raw::c_char,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_spawn_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        job_info: *const pmix_info_t,
        ninfo: usize,
        apps: *const pmix_app_t,
        napps: usize,
        cbfunc: pmix_spawn_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_connect_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_disconnect_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        procs: *const pmix_proc_t,
        nprocs: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_register_events_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        codes: *mut pmix_status_t,
        ncodes: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_deregister_events_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        codes: *mut pmix_status_t,
        ncodes: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_notify_event_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        code: pmix_status_t,
        source: *const pmix_proc_t,
        range: pmix_data_range_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_connection_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(incoming_sd: ::std::os::raw::c_int, cbdata: *mut ::std::os::raw::c_void),
>;
pub type pmix_server_listener_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        listening_sd: ::std::os::raw::c_int,
        cbfunc: pmix_connection_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_query_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proct: *mut pmix_proc_t,
        queries: *mut pmix_query_t,
        nqueries: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_tool_connection_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        proc_: *mut pmix_proc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_server_tool_connection_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_tool_connection_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_server_tool_connection2_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_tool_connection_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_log_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        client: *const pmix_proc_t,
        data: *const pmix_info_t,
        ndata: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type pmix_server_log2_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        client: *const pmix_proc_t,
        data: *const pmix_info_t,
        ndata: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_alloc_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        client: *const pmix_proc_t,
        directive: pmix_alloc_directive_t,
        data: *const pmix_info_t,
        ndata: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_job_control_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        requestor: *const pmix_proc_t,
        targets: *const pmix_proc_t,
        ntargets: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_monitor_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        requestor: *const pmix_proc_t,
        monitor: *const pmix_info_t,
        error: pmix_status_t,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_get_cred_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_credential_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_validate_cred_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        proc_: *const pmix_proc_t,
        cred: *const pmix_byte_object_t,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_validation_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_iof_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        procs: *const pmix_proc_t,
        nprocs: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        channels: pmix_iof_channel_t,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_stdin_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        source: *const pmix_proc_t,
        targets: *const pmix_proc_t,
        ntargets: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        bo: *const pmix_byte_object_t,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_grp_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        op: pmix_group_operation_t,
        grp: *mut ::std::os::raw::c_char,
        procs: *const pmix_proc_t,
        nprocs: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_fabric_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        requestor: *const pmix_proc_t,
        op: pmix_fabric_operation_t,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_session_control_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        requestor: *const pmix_proc_t,
        sessionID: u32,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
pub type pmix_server_resource_block_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        requestor: *const pmix_proc_t,
        directive: pmix_resource_block_directive_t,
        block: *const ::std::os::raw::c_char,
        units: *const pmix_resource_unit_t,
        nunit: usize,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmix_server_module_4_0_0_t {
    pub client_connected: pmix_server_client_connected_fn_t,
    pub client_finalized: pmix_server_client_finalized_fn_t,
    pub abort: pmix_server_abort_fn_t,
    pub fence_nb: pmix_server_fencenb_fn_t,
    pub direct_modex: pmix_server_dmodex_req_fn_t,
    pub publish: pmix_server_publish_fn_t,
    pub lookup: pmix_server_lookup_fn_t,
    pub unpublish: pmix_server_unpublish_fn_t,
    pub spawn: pmix_server_spawn_fn_t,
    pub connect: pmix_server_connect_fn_t,
    pub disconnect: pmix_server_disconnect_fn_t,
    pub register_events: pmix_server_register_events_fn_t,
    pub deregister_events: pmix_server_deregister_events_fn_t,
    pub listener: pmix_server_listener_fn_t,
    pub notify_event: pmix_server_notify_event_fn_t,
    pub query: pmix_server_query_fn_t,
    pub tool_connected: pmix_server_tool_connection_fn_t,
    pub log: pmix_server_log_fn_t,
    pub allocate: pmix_server_alloc_fn_t,
    pub job_control: pmix_server_job_control_fn_t,
    pub monitor: pmix_server_monitor_fn_t,
    pub get_credential: pmix_server_get_cred_fn_t,
    pub validate_credential: pmix_server_validate_cred_fn_t,
    pub iof_pull: pmix_server_iof_fn_t,
    pub push_stdin: pmix_server_stdin_fn_t,
    pub group: pmix_server_grp_fn_t,
    pub fabric: pmix_server_fabric_fn_t,
    pub client_connected2: pmix_server_client_connected2_fn_t,
    pub tool_connected2: pmix_server_tool_connection2_fn_t,
    pub log2: pmix_server_log2_fn_t,
    pub session_control: pmix_server_session_control_fn_t,
    pub resource_block: pmix_server_resource_block_fn_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmix_server_module_4_0_0_t"]
        [::std::mem::size_of::<pmix_server_module_4_0_0_t>() - 256usize];
    ["Alignment of pmix_server_module_4_0_0_t"]
        [::std::mem::align_of::<pmix_server_module_4_0_0_t>() - 8usize];
    ["Offset of field: pmix_server_module_4_0_0_t::client_connected"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, client_connected) - 0usize];
    ["Offset of field: pmix_server_module_4_0_0_t::client_finalized"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, client_finalized) - 8usize];
    ["Offset of field: pmix_server_module_4_0_0_t::abort"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, abort) - 16usize];
    ["Offset of field: pmix_server_module_4_0_0_t::fence_nb"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, fence_nb) - 24usize];
    ["Offset of field: pmix_server_module_4_0_0_t::direct_modex"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, direct_modex) - 32usize];
    ["Offset of field: pmix_server_module_4_0_0_t::publish"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, publish) - 40usize];
    ["Offset of field: pmix_server_module_4_0_0_t::lookup"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, lookup) - 48usize];
    ["Offset of field: pmix_server_module_4_0_0_t::unpublish"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, unpublish) - 56usize];
    ["Offset of field: pmix_server_module_4_0_0_t::spawn"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, spawn) - 64usize];
    ["Offset of field: pmix_server_module_4_0_0_t::connect"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, connect) - 72usize];
    ["Offset of field: pmix_server_module_4_0_0_t::disconnect"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, disconnect) - 80usize];
    ["Offset of field: pmix_server_module_4_0_0_t::register_events"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, register_events) - 88usize];
    ["Offset of field: pmix_server_module_4_0_0_t::deregister_events"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, deregister_events) - 96usize];
    ["Offset of field: pmix_server_module_4_0_0_t::listener"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, listener) - 104usize];
    ["Offset of field: pmix_server_module_4_0_0_t::notify_event"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, notify_event) - 112usize];
    ["Offset of field: pmix_server_module_4_0_0_t::query"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, query) - 120usize];
    ["Offset of field: pmix_server_module_4_0_0_t::tool_connected"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, tool_connected) - 128usize];
    ["Offset of field: pmix_server_module_4_0_0_t::log"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, log) - 136usize];
    ["Offset of field: pmix_server_module_4_0_0_t::allocate"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, allocate) - 144usize];
    ["Offset of field: pmix_server_module_4_0_0_t::job_control"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, job_control) - 152usize];
    ["Offset of field: pmix_server_module_4_0_0_t::monitor"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, monitor) - 160usize];
    ["Offset of field: pmix_server_module_4_0_0_t::get_credential"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, get_credential) - 168usize];
    ["Offset of field: pmix_server_module_4_0_0_t::validate_credential"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, validate_credential) - 176usize];
    ["Offset of field: pmix_server_module_4_0_0_t::iof_pull"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, iof_pull) - 184usize];
    ["Offset of field: pmix_server_module_4_0_0_t::push_stdin"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, push_stdin) - 192usize];
    ["Offset of field: pmix_server_module_4_0_0_t::group"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, group) - 200usize];
    ["Offset of field: pmix_server_module_4_0_0_t::fabric"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, fabric) - 208usize];
    ["Offset of field: pmix_server_module_4_0_0_t::client_connected2"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, client_connected2) - 216usize];
    ["Offset of field: pmix_server_module_4_0_0_t::tool_connected2"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, tool_connected2) - 224usize];
    ["Offset of field: pmix_server_module_4_0_0_t::log2"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, log2) - 232usize];
    ["Offset of field: pmix_server_module_4_0_0_t::session_control"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, session_control) - 240usize];
    ["Offset of field: pmix_server_module_4_0_0_t::resource_block"]
        [::std::mem::offset_of!(pmix_server_module_4_0_0_t, resource_block) - 248usize];
};
pub type pmix_server_module_t = pmix_server_module_4_0_0_t;
unsafe extern "C" {
    pub fn PMIx_server_init(
        module: *mut pmix_server_module_t,
        info: *mut pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_finalize() -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_generate_regex(
        input: *const ::std::os::raw::c_char,
        regex: *mut *mut ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_generate_ppn(
        input: *const ::std::os::raw::c_char,
        ppn: *mut *mut ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_register_nspace(
        nspace: *const ::std::os::raw::c_char,
        nlocalprocs: ::std::os::raw::c_int,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_deregister_nspace(
        nspace: *const ::std::os::raw::c_char,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn PMIx_server_register_client(
        proc_: *const pmix_proc_t,
        uid: uid_t,
        gid: gid_t,
        server_object: *mut ::std::os::raw::c_void,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_deregister_client(
        proc_: *const pmix_proc_t,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn PMIx_server_setup_fork(
        proc_: *const pmix_proc_t,
        env: *mut *mut *mut ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
pub type pmix_dmodex_response_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        data: *mut ::std::os::raw::c_char,
        sz: usize,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
    pub fn PMIx_server_dmodex_request(
        proc_: *const pmix_proc_t,
        cbfunc: pmix_dmodex_response_fn_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
pub type pmix_setup_application_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        status: pmix_status_t,
        info: *mut pmix_info_t,
        ninfo: usize,
        provided_cbdata: *mut ::std::os::raw::c_void,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
    pub fn PMIx_server_setup_application(
        nspace: *const ::std::os::raw::c_char,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_setup_application_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_setup_local_support(
        nspace: *const ::std::os::raw::c_char,
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_IOF_deliver(
        source: *const pmix_proc_t,
        channel: pmix_iof_channel_t,
        bo: *const pmix_byte_object_t,
        info: *const pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_collect_inventory(
        directives: *mut pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_info_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_deliver_inventory(
        info: *mut pmix_info_t,
        ninfo: usize,
        directives: *mut pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_Register_attributes(
        function: *mut ::std::os::raw::c_char,
        attrs: *mut *mut ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_generate_locality_string(
        cpuset: *const pmix_cpuset_t,
        locality: *mut *mut ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_generate_cpuset_string(
        cpuset: *const pmix_cpuset_t,
        cpuset_string: *mut *mut ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_generate_cpuset(
        cpuset_string: *const ::std::os::raw::c_char,
        cpuset: *mut pmix_cpuset_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_define_process_set(
        members: *const pmix_proc_t,
        nmembers: usize,
        pset_name: *const ::std::os::raw::c_char,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_delete_process_set(pset_name: *mut ::std::os::raw::c_char) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_register_resources(
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_deregister_resources(
        info: *mut pmix_info_t,
        ninfo: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_server_collect_job_info(
        procs: *mut pmix_proc_t,
        nprocs: usize,
        dbuf: *mut pmix_data_buffer_t,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_tool_init(
        proc_: *mut pmix_proc_t,
        info: *mut pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_tool_set_server_module(module: *mut pmix_server_module_t) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_tool_finalize() -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_tool_is_connected() -> bool;
}
unsafe extern "C" {
    pub fn PMIx_tool_attach_to_server(
        myproc: *mut pmix_proc_t,
        server: *mut pmix_proc_t,
        info: *mut pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_tool_disconnect(server: *const pmix_proc_t) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_tool_get_servers(
        servers: *mut *mut pmix_proc_t,
        nservers: *mut usize,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_tool_set_server(
        server: *const pmix_proc_t,
        info: *mut pmix_info_t,
        ninfo: usize,
    ) -> pmix_status_t;
}
pub type pmix_iof_cbfunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        iofhdlr: usize,
        channel: pmix_iof_channel_t,
        source: *mut pmix_proc_t,
        payload: *mut pmix_byte_object_t,
        info: *mut pmix_info_t,
        ninfo: usize,
    ),
>;
unsafe extern "C" {
    pub fn PMIx_IOF_pull(
        procs: *const pmix_proc_t,
        nprocs: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        channel: pmix_iof_channel_t,
        cbfunc: pmix_iof_cbfunc_t,
        regcbfunc: pmix_hdlr_reg_cbfunc_t,
        regcbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_IOF_deregister(
        iofhdlr: usize,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
unsafe extern "C" {
    pub fn PMIx_IOF_push(
        targets: *const pmix_proc_t,
        ntargets: usize,
        bo: *mut pmix_byte_object_t,
        directives: *const pmix_info_t,
        ndirs: usize,
        cbfunc: pmix_op_cbfunc_t,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> pmix_status_t;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::std::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::std::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::std::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::std::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::std::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::std::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_data {
    pub _address: u8,
}
